/*
Navicat MySQL Data Transfer

Source Server         : localhost
Source Server Version : 50717
Source Host           : localhost:3306
Source Database       : canteen

Target Server Type    : MYSQL
Target Server Version : 50717
File Encoding         : 65001

Date: 2019-04-11 18:44:02
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for admin
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(255) NOT NULL,
  `password` varchar(255) NOT NULL,
  `right` int(11) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('1', 'root', 'root', '2');
INSERT INTO `admin` VALUES ('2', '321', '321', '0');

-- ----------------------------
-- Table structure for dishes
-- ----------------------------
DROP TABLE IF EXISTS `dishes`;
CREATE TABLE `dishes` (
  `id` int(16) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `foodName` varchar(255) DEFAULT NULL,
  `foodPrice` float DEFAULT '5' COMMENT '食物价格',
  `foodWeight` float DEFAULT '500' COMMENT '食物重量',
  `cost_performance` int(11) DEFAULT '20' COMMENT '性价比',
  `address` varchar(255) DEFAULT NULL COMMENT '餐厅',
  `date` varchar(255) DEFAULT NULL COMMENT '生产时间',
  `firstCategory` varchar(255) DEFAULT NULL,
  `secondCategory` varchar(255) DEFAULT NULL,
  `foods` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=112 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of dishes
-- ----------------------------
INSERT INTO `dishes` VALUES ('1', '炒青菜', '5', '500', '20', '第三食堂', '20190304', '菜肴', '素菜', '小白菜 350.0g\r\n葵花籽油 10.0g\r\n姜 1.0g\r\n食盐 4.0g');
INSERT INTO `dishes` VALUES ('2', '番茄炒蛋', '5', '500', '20', '第三食堂', '20190304', '菜肴', '肉菜', '鸡蛋 150克\r\n番茄 300克 大蒜 5克\r\n大葱 5克\r\n食盐 3克\r\n白砂糖 5克\r\n味精 2克');
INSERT INTO `dishes` VALUES ('3', '吐司面包', '5', '500', '20', '第三食堂', '20190304', '主食', '面包', '小麦粉(标准粉) 270.0g\r\n全脂奶粉（雀巢） 30.0g\r\n白砂糖 30.0g\r\n食盐 3.0g\r\n酵母(干) 5.0g\r\n鸡蛋 50.0g\r\n金龙鱼 玉米油 20.0g\r\n饮用水 120.0g');
INSERT INTO `dishes` VALUES ('4', '绿豆汤', '5', '500', '20', '第三食堂', '20190304', '汤类', '汤类', '白砂糖 50.0g\r\n饮用水 1000.0g\r\n绿豆（干） 100.0g');
INSERT INTO `dishes` VALUES ('5', '素炒小白菜', '5', '500', '20', '第三食堂', '20190304', null, null, '小白菜 300克 酱油 10克\r\n姜 5克\r\n食盐 3克');
INSERT INTO `dishes` VALUES ('6', '烧茄子', '5', '500', '20', '第三食堂', '20190304', null, null, '茄子(紫皮，长) 500克 酱油 25克\r\n味精 5克\r\n食盐 5克\r\n豌豆淀粉 10克\r\n大葱 5克\r\n姜 5克\r\n大蒜 5克\r\n花生油 30克');
INSERT INTO `dishes` VALUES ('7', '绿豆粥', '5', '500', '20', '第三食堂', '20190304', null, null, '大米 25克\r\n绿豆（干） 25克');
INSERT INTO `dishes` VALUES ('8', '香菇青菜包', '5', '500', '20', '第三食堂', '20190304', null, null, '小白菜 25.44g\r\n白砂糖 2.0g\r\n饮用水 17.0g\r\n食盐 1.2g\r\n酵母(干) 0.28g\r\n豆油 1.5g\r\n胡椒粉 0.38g\r\n豆腐干（白干） 20.0g\r\n香菇（鲜） 1.9g\r\n味精 0.64g\r\n小麦粉(标准粉) 31.8g');
INSERT INTO `dishes` VALUES ('9', '牛肉面', '5', '500', '20', '第三食堂', '20190304', null, null, '酱牛肉 50.0g\r\n面条（生） 150.0g\r\n小白菜 40.0g\r\n香菜 10.0g\r\n平菇 20.0g\r\n鸡蛋 50.0g\r\n食盐 4.0g\r\n醋 4.0g\r\n胡椒粉 3.0g\r\n辣椒油 7.0g\r\n番茄 10.0g\r\n饮用水 250.0g');
INSERT INTO `dishes` VALUES ('10', '蛋炒饭', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡蛋 70.0g\r\n米饭 250.0g\r\n酱油 3.0g\r\n金龙鱼 玉米油 15.0g\r\n食盐 3.0g');
INSERT INTO `dishes` VALUES ('11', '红烧鳓鱼', '5', '500', '20', '第三食堂', '20190304', null, null, '鳓鱼 1000克 猪油(板油) 80克 醋 10克\r\n大蒜 50克\r\n食盐 6克\r\n小葱 5克\r\n好时 焦糖糖浆 20克\r\n白砂糖 30克\r\n八角 3克\r\n味精 3克\r\n姜 2克\r\n玉米淀粉 5克\r\n料酒 25克\r\n酱油 30克\r\n花生油 50克\r\n姜(子姜) 20克\r\n饮用水 50克');
INSERT INTO `dishes` VALUES ('12', '葱油饼', '5', '500', '20', '第三食堂', '20190304', null, null, '小麦粉(标准粉) 250.0g\r\n花生油 30.0g\r\n饮用水 100.0g\r\n小葱 50.0g\r\n食盐 10.0g');
INSERT INTO `dishes` VALUES ('13', '炒绿豆芽', '5', '500', '20', '第三食堂', '20190304', null, null, '豆芽（绿豆芽） 400克 菜籽油 5克');
INSERT INTO `dishes` VALUES ('14', '盐水虾', '5', '500', '20', '第三食堂', '20190304', null, null, '对虾 500克 食盐 5克\r\n鸡精 2克\r\n料酒 8克\r\n胡椒粉 4克\r\n酱油 5克\r\n大葱 5克\r\n姜 3克');
INSERT INTO `dishes` VALUES ('15', '清炒西葫芦', '5', '500', '20', '第三食堂', '20190304', null, null, '西葫芦 350.0g\r\n食盐 3.0g\r\n味精 2.0g\r\n虾皮 10.0g\r\n大蒜(紫皮) 10.0g\r\n豆油 10.0g');
INSERT INTO `dishes` VALUES ('16', '西红柿鸡蛋面', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡蛋 120.0g\r\n香油 30.0g\r\n芹菜（水芹） 50.0g\r\n饮用水 500.0g\r\n食盐 3.0g\r\n鸡精 20.0g\r\n番茄 200.0g\r\n面条(标准粉，切面) 200.0g');
INSERT INTO `dishes` VALUES ('17', '酸辣土豆丝', '5', '500', '20', '第三食堂', '20190304', null, null, '马铃薯 300克 青椒 15克\r\n辣椒(红，小) 15克 花椒 2克\r\n辣椒(红，尖，干) 5克\r\n大葱 5克\r\n食盐 3克\r\n味精 2克\r\n香醋 5克\r\n花生油 15克\r\n香油 5克');
INSERT INTO `dishes` VALUES ('18', '红烧肉', '5', '500', '20', '第三食堂', '20190304', null, null, '猪肉(肋条肉) 750克 酱油 100克\r\n黄酒 80克\r\n白砂糖 40克\r\n大葱 10克\r\n姜 5克\r\n猪油(炼) 20克');
INSERT INTO `dishes` VALUES ('19', '韭菜包子', '5', '500', '20', '第三食堂', '20190304', null, null, '小麦粉(标准粉) 500.0g\r\n韭菜 500.0g\r\n鸡蛋 200.0g\r\n粉丝（干） 100.0g\r\n鸡精 5.0g\r\n花生油 20.0g\r\n食盐 10.0g\r\n饮用水 250.0g');
INSERT INTO `dishes` VALUES ('20', '卤鸡蛋', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡蛋 1200克 花椒 15克\r\n食盐 30克\r\n八角 15克\r\n酱油 20克\r\n大葱 30克\r\n姜 15克\r\n肉豆蔻 10克\r\n高良姜 10克');
INSERT INTO `dishes` VALUES ('21', '清炒土豆丝', '5', '500', '20', '第三食堂', '20190304', null, null, '马铃薯 300克 花生油 8克 大葱 5克\r\n食盐 4克\r\n味精 2克\r\n醋 3克');
INSERT INTO `dishes` VALUES ('22', ' 西红柿鸡蛋汤', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡蛋 50.0g\r\n番茄 50.0g\r\n胡椒粉 1.0g\r\n饮用水 500.0g');
INSERT INTO `dishes` VALUES ('23', '炒大白菜（清淡版）', '5', '500', '20', '第三食堂', '20190304', null, null, '大白菜 500.0g\r\n辣椒(红，尖，干) 5.0g\r\n食盐 4.0g\r\n白砂糖 5.0g\r\n豆油 10.0g');
INSERT INTO `dishes` VALUES ('24', '烧麦', '5', '500', '20', '第三食堂', '20190304', null, null, '猪肉(瘦) 80.0g\r\n香菇（鲜） 30.0g\r\n胡萝卜（老） 30.0g\r\n小麦面粉（特制） 100.0g\r\n糯米 200.0g\r\n饮用水 100.0g\r\n金龙鱼 玉米油 10.0g\r\n食盐 10.0g\r\n酱油 30.0g\r\n鸡精 10.0g');
INSERT INTO `dishes` VALUES ('25', '清爽西兰花', '5', '500', '20', '第三食堂', '20190304', null, null, '西兰花 200克\r\n胡萝卜（嫩） 100克 食盐 2克\r\n胡椒粉 1克\r\n鸡精 1克\r\n香油 1克');
INSERT INTO `dishes` VALUES ('26', ' 大饼', '5', '500', '20', '第三食堂', '20190304', null, null, '小麦粉(标准粉) 250.0g\r\n饮用水 180.0g\r\n粟米油 10.0g\r\n食盐 3.0g\r\n五香粉 3.0g');
INSERT INTO `dishes` VALUES ('27', '清蒸鱼', '5', '500', '20', '第三食堂', '20190304', null, null, '鲮鱼 500.0g\r\n姜 20.0g\r\n食盐 5.0g\r\n酱油 10.0g\r\n大葱 10.0g\r\n花生油 10.0g');
INSERT INTO `dishes` VALUES ('28', '酸菜鱼', '5', '500', '20', '第三食堂', '20190304', null, null, '鲤鱼 1000克\r\n酸白菜 200克 剁辣椒 20克 味精 2克\r\n姜 10克\r\n大蒜 10克\r\n食盐 3克\r\n胡椒粉 2克\r\n豌豆淀粉 5克\r\n鸡蛋白（鸡蛋清） 30克\r\n花生油 20克\r\n饮用水 100克');
INSERT INTO `dishes` VALUES ('29', '寿司 自制1', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡蛋 50.0g\r\n信孚 烤海苔 2.5g\r\n黄瓜 50.0g\r\n太仓肉松 20.0g\r\n肯德基 玉米沙拉 30.0g\r\n粳米饭 200.0g\r\n胡萝卜（老） 30.0g\r\n香油 4.0g\r\n黑芝麻 4.0g\r\n花生油 5.0g\r\n火腿肠 30.0g');
INSERT INTO `dishes` VALUES ('30', '麻婆豆腐', '5', '500', '20', '第三食堂', '20190304', null, null, '豆腐(北) 250克 牛肉(肥瘦) 75克 五香豆豉 15克\r\n料酒 5克\r\n食盐 3克\r\n味精 2克\r\n豌豆淀粉 5克\r\n花生油 12克\r\n小葱 5克\r\n百里香 15克');
INSERT INTO `dishes` VALUES ('31', '烧包菜丝', '5', '500', '20', '第三食堂', '20190304', null, null, '卷心菜（包菜，圆白菜） 500克 葵花籽油 10克 虾米 25克\r\n玉兰片 25克\r\n姜 5克\r\n味精 1克\r\n料酒 5克\r\n食盐 3克\r\n香菇（鲜） 25克');
INSERT INTO `dishes` VALUES ('32', '酸辣粉', '5', '500', '20', '第三食堂', '20190304', null, null, '粉条（干） 50.0g\r\n姜 5.0g\r\n大蒜 5.0g\r\n香菜 10.0g\r\n芹菜（药芹） 10.0g\r\n榨菜 10.0g\r\n酱油 5.0g\r\n醋 10.0g\r\n辣椒油 10.0g\r\n花生米（油炸） 10.0g\r\n胡椒粉 5.0g\r\n花椒 5.0g\r\n味精 5.0g\r\n鸡精 5.0g\r\n食盐 7.0g\r\n史云生原味高汤 50.0g\r\n小葱 10.0g\r\n饮用水 200.0g');
INSERT INTO `dishes` VALUES ('33', '青椒炒鸡蛋', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡蛋 200克\r\n青椒 100克 食盐 3克\r\n味精 2克\r\n香醋 5克\r\n大葱 10克');
INSERT INTO `dishes` VALUES ('34', '素炒芹菜', '5', '500', '20', '第三食堂', '20190304', null, null, '芹菜茎 500克 食盐 3克\r\n花椒 3克\r\n大葱 10克');
INSERT INTO `dishes` VALUES ('35', '粽子', '5', '500', '20', '第三食堂', '20190304', null, null, '糯米 700.0g\r\n红豆沙 500.0g\r\n黄米 300.0g\r\n莲子(干) 25.0g\r\n红枣(干) 25.0g\r\n花豆(红) 100.0g\r\n花豆(紫) 100.0g\r\n红豆 100.0g\r\n饮用水 1100.0g');
INSERT INTO `dishes` VALUES ('36', '椒油拌海带', '5', '500', '20', '第三食堂', '20190304', null, null, '海带（浸） 300克 辣椒油 20克\r\n食盐 3克\r\n酱油 10克\r\n醋 10克\r\n味精 3克\r\n姜 5克\r\n香菜 5克');
INSERT INTO `dishes` VALUES ('37', '烙玉米饼', '5', '500', '20', '第三食堂', '20190304', null, null, '玉米糁(黄) 100.0g\r\n雀巢 脱脂牛奶 100.0g\r\n鸡蛋 50.0g\r\nWatson’s屈臣氏苏打水 50.0g');
INSERT INTO `dishes` VALUES ('38', '蔬菜沙拉', '5', '500', '20', '第三食堂', '20190304', null, null, '卷心菜（包菜，圆白菜） 200克\r\n番茄 80克\r\n黄瓜 60克\r\n洋葱 30克\r\n青椒 30克 芝麻油 5克 柠檬汁 20克\r\n蜂蜜 10克\r\n食盐 2克');
INSERT INTO `dishes` VALUES ('39', '清炒卷心菜', '5', '500', '20', '第三食堂', '20190304', null, null, '卷心菜（包菜，圆白菜） 400.0g\r\n酱油 10.0g\r\n大葱 10.0g\r\n味精 1.0g\r\n食盐 3.0g\r\n豆油 10.0g');
INSERT INTO `dishes` VALUES ('40', '蒜味烧茄子', '5', '500', '20', '第三食堂', '20190304', null, null, '茄子 300克 大蒜 20克\r\n酱油 10克\r\n食盐 3克\r\n八角 2克\r\n大葱 3克\r\n姜 3克\r\n白砂糖 10克\r\n花生油 50克');
INSERT INTO `dishes` VALUES ('41', '红烧大排', '5', '500', '20', '第三食堂', '20190304', null, null, '猪大排 300.0g\r\n食盐 2.0g\r\n白砂糖 10.0g\r\n鸡精 5.0g\r\n老抽 15.0g\r\n大葱 2.0g\r\n姜 2.0g\r\n薤白 2.0g\r\n饮用水 50.0g\r\n花生油 15.0g');
INSERT INTO `dishes` VALUES ('42', '杂粮煎饼', '5', '500', '20', '第三食堂', '20190304', null, null, '小麦粉(标准粉) 88.0g\r\n玉米淀粉 4.0g\r\n高粱米 4.0g\r\n黄豆粉 2.0g\r\n苦荞麦粉 2.0g\r\n饮用水 45.0g\r\n豆油 5.0g\r\n鸡蛋 50.0g\r\n小葱 5.0g\r\n油条 20.0g');
INSERT INTO `dishes` VALUES ('43', ' 玉米汤小米粥', '5', '500', '20', '第三食堂', '20190304', null, null, '小米 100.0g\r\n饮用水 1100.0g\r\n玉米（鲜） 100.0g');
INSERT INTO `dishes` VALUES ('44', '肉松面包', '5', '500', '20', '第三食堂', '20190304', null, null, '小麦粉(标准粉) 200.0g\r\n白砂糖 60.0g\r\n食盐 4.0g\r\n酵母(干) 4.0g\r\n鸡蛋 60.0g\r\n黄油 45.0g\r\n饮用水 90.0g\r\n猪肉松 100.0g');
INSERT INTO `dishes` VALUES ('45', '豆沙包', '5', '500', '20', '第三食堂', '20190304', null, null, '小麦粉(标准粉) 40.0g\r\n红豆沙 15.0g');
INSERT INTO `dishes` VALUES ('46', '麻酱拌黄瓜', '5', '500', '20', '第三食堂', '20190304', null, null, '黄瓜 500克 芝麻酱 10克\r\n大葱 5克\r\n食盐 3克\r\n酱油 5克\r\n醋 5克\r\n花生油 15克');
INSERT INTO `dishes` VALUES ('47', '清拌黄瓜', '5', '500', '20', '第三食堂', '20190304', null, null, '黄瓜 300克');
INSERT INTO `dishes` VALUES ('48', '清蒸鸡蛋羹', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡蛋 200克 食盐 2克\r\n江米酒 5克\r\n白砂糖 2克');
INSERT INTO `dishes` VALUES ('49', '红烧带鱼', '5', '500', '20', '第三食堂', '20190304', null, null, '带鱼 100克 酱油 4克\r\n白砂糖 2克\r\n醋 3克\r\n料酒 5克\r\n大葱 4克\r\n大蒜 3克\r\n姜 3克');
INSERT INTO `dishes` VALUES ('50', '虾皮冬瓜丝', '5', '500', '20', '第三食堂', '20190304', null, null, '冬瓜 350克\r\n河虾 150克 大蒜 10克\r\n食盐 3克\r\n味精 2克\r\n花椒 2克\r\n大葱 5克\r\n花生油 5克');
INSERT INTO `dishes` VALUES ('51', '红烧鸡块', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡 500克 酱油 50克\r\n白砂糖 60克\r\n食盐 5克\r\n甜面酱 10克\r\n大葱 10克\r\n姜 10克\r\n料酒 10克\r\n五香粉 1克\r\n花生油 50克');
INSERT INTO `dishes` VALUES ('52', '红卤鸡爪', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡爪 300克 黄酒 25克\r\n酱油 35克\r\n白砂糖 50克\r\n大葱 12克\r\n姜 5克\r\n八角 5克\r\n肉桂 1克');
INSERT INTO `dishes` VALUES ('53', '扬州蛋炒饭', '5', '500', '20', '第三食堂', '20190304', null, null, '粳米饭 1000克\r\n鸡蛋 500克 火腿 50克\r\n虾仁（红） 5克\r\n鸭肫 30克\r\n海参(水浸) 25克\r\n冬笋 25克\r\n豌豆（干） 25克\r\n鸡胸脯肉 50克\r\n鸡胸脯肉 40克\r\n扇贝(干) 15克\r\n香菇（鲜） 25克\r\n蒜苔 25克 黄酒 15克\r\n小葱 15克\r\n食盐 20克\r\n猪油(炼) 50克\r\n饮用水 25克');
INSERT INTO `dishes` VALUES ('54', '蛋挞', '5', '500', '20', '第三食堂', '20190304', null, null, '黄油 125.0g\r\n小麦粉(标准粉) 200.0g\r\n牛奶 100.0g\r\n绵白糖 85.0g\r\n鸡蛋 120.0g');
INSERT INTO `dishes` VALUES ('55', '炒土豆丝', '5', '500', '20', '第三食堂', '20190304', null, null, '马铃薯 200克 辣椒(红，小) 5克 白醋 10克\r\n白砂糖 5克\r\n味精 1克\r\n花生油 10克\r\n食盐 3克');
INSERT INTO `dishes` VALUES ('56', '牛肉包子', '5', '500', '20', '第三食堂', '20190304', null, null, '小麦面粉（特制） 450.0g\r\n牛肉(后腿) 300.0g\r\n菜籽油 30.0g\r\n竹笋 50.0g\r\n芹菜茎 50.0g\r\n姜 10.0g\r\n酱油 10.0g\r\n食盐 0.5g\r\n味精 1.0g\r\n饮用水 150.0g');
INSERT INTO `dishes` VALUES ('57', ' 炒面/炒粉', '5', '500', '20', '第三食堂', '20190304', null, null, '面条（生） 200.0g\r\n小白菜 40.0g\r\n豆芽（绿豆芽） 60.0g\r\n酱油 30.0g\r\n色拉油 10.0g\r\n白砂糖 2.0g\r\n猪肉(瘦) 20.0g\r\n豌豆淀粉 5.0g\r\n饮用水 20.0g');
INSERT INTO `dishes` VALUES ('58', '韭菜炒绿豆芽', '5', '500', '20', '第三食堂', '20190304', null, null, '豆芽（绿豆芽） 500克\r\n韭菜 100克 姜 5克\r\n食盐 3克\r\n味精 2克');
INSERT INTO `dishes` VALUES ('59', '千层饼', '5', '500', '20', '第三食堂', '20190304', null, null, '小麦 500.0g\r\n食盐 5.0g\r\n猪油(炼) 50.0g\r\n饮用水 200.0g');
INSERT INTO `dishes` VALUES ('60', '菜煎饼', '5', '500', '20', '第三食堂', '20190304', null, null, '小麦粉(标准粉) 50.0g\r\n大白菜 25.0g\r\n大白菜(小白口) 25.0g\r\n胡萝卜（嫩） 25.0g\r\n水萝卜 25.0g\r\n菠菜 25.0g\r\n鸡蛋 100.0g\r\n豆油 10.0g');
INSERT INTO `dishes` VALUES ('61', '炒胡萝卜片', '5', '500', '20', '第三食堂', '20190304', null, null, '胡萝卜（嫩） 300克 大葱 5克\r\n酱油 15克\r\n食盐 1克\r\n白砂糖 3克\r\n味精 1克\r\n蒜苗 10克');
INSERT INTO `dishes` VALUES ('62', '清炒油麦菜', '5', '500', '20', '第三食堂', '20190304', null, null, '油麦菜 300克 辣椒(红，尖，干) 4克\r\n青椒 10克');
INSERT INTO `dishes` VALUES ('63', '红烧豆腐', '5', '500', '20', '第三食堂', '20190304', null, null, '豆腐 300.0g\r\n辣椒(红，尖，干) 3.0g\r\n大蒜 5.0g\r\n姜 5.0g\r\n绵白糖 5.0g\r\n老抽 6.0g\r\n料酒 5.0g\r\n胡椒粉 3.0g\r\n食盐 4.0g\r\n味精 3.0g\r\n色拉油 10.0g\r\n饮用水 60.0g');
INSERT INTO `dishes` VALUES ('64', '红烧茄子', '5', '500', '20', '第三食堂', '20190304', null, null, '茄子(紫皮，长) 500克 花生油 25克 辣椒(红，尖，干) 10克\r\n豌豆淀粉 10克\r\n食盐 3克\r\n大葱 5克\r\n大蒜 5克\r\n八角 2克\r\n酱油 25克\r\n味精 2克');
INSERT INTO `dishes` VALUES ('65', '蒜茸海带', '5', '500', '20', '第三食堂', '20190304', null, null, '海带（浸） 300克\r\n胡萝卜（嫩） 100克 香油 10克 香菜 50克\r\n大蒜 10克\r\n酱油 20克\r\n醋 10克\r\n白砂糖 10克\r\n味精 2克');
INSERT INTO `dishes` VALUES ('66', '烧花菜', '5', '500', '20', '第三食堂', '20190304', null, null, '花菜 350克 胡萝卜（嫩） 50克\r\n香菇（鲜） 100克 色拉油 20克\r\n食盐 5克\r\n味精 2克\r\n酱油 2克\r\n大葱 10克\r\n辣椒油 5克\r\n豌豆淀粉 4克');
INSERT INTO `dishes` VALUES ('67', '黄瓜炒蛋', '5', '500', '20', '第三食堂', '20190304', null, null, '黄瓜 500.0g\r\n鸡蛋 200.0g\r\n料酒 5.0g\r\n豆油 20.0g\r\n食盐 6.0g');
INSERT INTO `dishes` VALUES ('68', '清蒸蛋羹', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡蛋 150克 猪肉(瘦) 25克\r\n饮用水 300克 香油 5克\r\n酱油 5克\r\n食盐 2克\r\n大葱 5克');
INSERT INTO `dishes` VALUES ('69', '黄瓜炒鸡蛋', '5', '500', '20', '第三食堂', '20190304', null, null, '黄瓜 350.0g\r\n鸡蛋 130.0g\r\n豆油 20.0g\r\n食盐 3.0g\r\n小葱 5.0g');
INSERT INTO `dishes` VALUES ('70', '炒豇豆', '5', '500', '20', '第三食堂', '20190304', null, null, '豇豆 500.0g\r\n料酒 10.0g\r\n姜(子姜) 10.0g\r\n大葱 10.0g\r\n生抽 10.0g\r\n辣椒（小红尖辣椒） 10.0g\r\n大蒜 5.0g\r\n粟米油 5.0g');
INSERT INTO `dishes` VALUES ('71', '咖喱鸡块土豆', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡胸脯肉 150克\r\n马铃薯 100克 咖喱粉 5克\r\n酱油 10克\r\n食盐 3克\r\n大葱 3克\r\n姜 3克\r\n饮用水 100克');
INSERT INTO `dishes` VALUES ('72', '肉片炒花菜', '5', '500', '20', '第三食堂', '20190304', null, null, '花菜 250克\r\n猪肉(瘦) 75克 花生油 10克 料酒 10克\r\n大葱 8克\r\n姜 8克\r\n大蒜 8克\r\n食盐 3克\r\n酱油 10克\r\n味精 2克\r\n亿巢 食用鸡油 10克\r\n豌豆淀粉 5克\r\n青椒 10克');
INSERT INTO `dishes` VALUES ('73', '韭菜炒鸡蛋', '5', '500', '20', '第三食堂', '20190304', null, null, '韭菜 200克\r\n鸡蛋 150克\r\n花生油 12克 食盐 4克');
INSERT INTO `dishes` VALUES ('74', '茶叶蛋', '5', '500', '20', '第三食堂', '20190304', null, null, '鸡蛋 400克 红茶 10克\r\n姜 10克\r\n大葱 10克\r\n酱油 50克\r\n八角 3克\r\n肉桂 20克\r\n食盐 3克\r\n白砂糖 40克\r\n料酒 30克\r\n铁观音茶（茶叶本身） 10克');
INSERT INTO `dishes` VALUES ('75', '丝瓜炒蛋', '5', '500', '20', '第三食堂', '20190304', null, null, '丝瓜 250克\r\n鸡蛋 150克 香油 3克\r\n食盐 3克\r\n味精 2克\r\n大葱 3克');
INSERT INTO `dishes` VALUES ('76', '肉丝茭白', '5', '500', '20', '第三食堂', '20190304', null, null, '茭白 500克\r\n猪肉(瘦) 150克 酱油 20克\r\n食盐 5克\r\n味精 3克\r\n料酒 10克\r\n鸡蛋 30克\r\n豌豆淀粉 6克\r\n大葱 10克\r\n姜 10克');
INSERT INTO `dishes` VALUES ('77', '虾仁蒸肠粉', '5', '500', '20', '第三食堂', '20190304', null, null, '米粉（干） 100.0g\r\n食盐 5.0g\r\n花生油 10.0g\r\n饮用水 200.0g\r\n虾仁（红） 100.0g\r\n酱油 150.0g\r\n白砂糖 5.0g\r\n鸡精 12.0g\r\n胡椒粉 10.0g\r\n芝麻油 10.0g');
INSERT INTO `dishes` VALUES ('78', '肉片炒青椒', '5', '500', '20', '第三食堂', '20190304', null, null, '猪肉(瘦) 100克\r\n青椒 200克 料酒 10克\r\n大葱 10克\r\n姜 10克\r\n食盐 4克\r\n味精 2克\r\n白砂糖 2克\r\n酱油 5克\r\n豌豆淀粉 10克');
INSERT INTO `dishes` VALUES ('79', '五香鸭肉', '5', '500', '20', '第三食堂', '20190304', null, null, '鸭肉 500克 鸡蛋 60克\r\n小麦面粉（特制） 25克\r\n大葱 165克\r\n甜面酱 50克\r\n花生油 100克\r\n料酒 15克\r\n食盐 3克\r\n味精 2克\r\n白砂糖 5克\r\n五香粉 1克\r\n豌豆淀粉 10克\r\n姜 15克\r\n香油 5克');
INSERT INTO `dishes` VALUES ('80', '土豆烧肉', '5', '500', '20', '第三食堂', '20190304', null, null, '马铃薯 250克\r\n猪肉(瘦) 250克 酱油 50克\r\n食盐 3克\r\n黄酒 10克\r\n白砂糖 20克\r\n大葱 10克\r\n姜 5克\r\n花生油 50克');
INSERT INTO `dishes` VALUES ('81', '辣椒清炒苦瓜', '5', '500', '20', null, null, null, null, '青椒 250克\r\n苦瓜 250克 食盐 4克\r\n味精 2克\r\n香油 10克');
INSERT INTO `dishes` VALUES ('82', '炸花生米', '5', '500', '20', null, null, null, null, '花生米（生） 500克 色拉油 50克\r\n食盐 5克');
INSERT INTO `dishes` VALUES ('83', '小炒香干芹菜', '5', '500', '20', null, null, null, null, '芹菜茎 500克\r\n祖名五香干 100克 色拉油 50克\r\n食盐 5克\r\n味精 3克\r\n酱油 4克\r\n辣椒(红，尖，干) 15克\r\n姜 5克\r\n香油 10克');
INSERT INTO `dishes` VALUES ('84', '洋白菜包子', '5', '500', '20', null, null, null, null, '小麦面粉（特制） 800.0g\r\n豆腐干（白干） 200.0g\r\n结球甘蓝（绿） 800.0g\r\n粉丝（干） 50.0g\r\n鸡蛋 200.0g\r\n食盐 10.0g\r\n鸡精 20.0g\r\n粟米油 40.0g\r\n大葱 30.0g\r\n姜 30.0g\r\n饮用水 600.0g');
INSERT INTO `dishes` VALUES ('85', '寿司 自制2', '5', '500', '20', null, null, null, null, '米饭 500.0g\r\nNagai\'s 永井海苔 10.0g\r\n寿司醋 10.0g\r\n鸡蛋 100.0g\r\n黄瓜 200.0g\r\n蟹足棒 100.0g\r\n粟米油 5.0g');
INSERT INTO `dishes` VALUES ('86', '鱼香茄子', '5', '500', '20', null, null, null, null, '茄子(紫皮，长) 450克\r\n猪肉(瘦) 120克 香油 20克 豌豆淀粉 10克\r\n胡椒粉 2克\r\n大蒜 10克\r\n姜 10克\r\n大葱 10克\r\n白砂糖 5克\r\n食盐 2克\r\n醋 2克\r\n料酒 10克\r\n酱油 15克\r\n豆瓣辣酱 15克');
INSERT INTO `dishes` VALUES ('87', '核桃酥', '5', '500', '20', null, null, null, null, '小麦粉(富强粉，特一粉) 1000.0g\r\n白砂糖 400.0g\r\n绵白糖 200.0g\r\n核桃（干） 80.0g\r\n猪油(板油) 55.0g\r\n鸡蛋 200.0g');
INSERT INTO `dishes` VALUES ('88', '无糖银耳汤', '5', '500', '20', null, null, null, null, '银耳(干) 10.0g\r\n红枣(干) 10.0g\r\n百合(干) 10.0g\r\n枸杞 10.0g\r\n饮用水 1000.0g');
INSERT INTO `dishes` VALUES ('89', '蒜拌绿豆芽', '5', '500', '20', null, null, null, null, '豆芽（绿豆芽） 300克 食盐 2克\r\n大蒜 15克\r\n醋 5克\r\n白砂糖 3克\r\n味精 2克');
INSERT INTO `dishes` VALUES ('90', '凉拌海带丝', '5', '500', '20', null, null, null, null, '海带（浸） 300克 花生油 5克 食盐 3克\r\n味精 2克\r\n酱油 2克\r\n香油 3克\r\n白砂糖 2克\r\n姜 3克');
INSERT INTO `dishes` VALUES ('91', '泡椒凤爪', '5', '500', '20', null, null, null, null, '鸡爪 300克 辣椒(红，尖，干) 100克 大蒜 10克\r\n花椒 5克\r\n胡椒粉 2克\r\n味精 2克\r\n食盐 5克\r\n饮用水 100克');
INSERT INTO `dishes` VALUES ('92', '烤鸡翅', '5', '500', '20', null, null, null, null, '鸡翅 500克 大葱 10克\r\n姜 5克\r\n酱油 5克\r\n胡椒粉 2克\r\n料酒 10克\r\n味精 2克\r\n食盐 5克\r\n蜂蜜 5克\r\n花生油 15克');
INSERT INTO `dishes` VALUES ('93', '青椒炒花菜', '5', '500', '20', null, null, null, null, '花菜 300克\r\n青椒 50克 豆油 10克 胡萝卜（嫩） 15克\r\n虾米 10克\r\n醋 5克\r\n香油 5克\r\n食盐 3克\r\n味精 2克\r\n白砂糖 5克\r\n饮用水 10克\r\n姜 5克');
INSERT INTO `dishes` VALUES ('94', '自制豆浆(无糖）', '5', '500', '20', null, null, null, null, '黄豆 37.0g\r\n饮用水 1000.0g');
INSERT INTO `dishes` VALUES ('95', '赤豆粽子', '5', '500', '20', null, null, null, null, '糯米 1500.0g\r\n红豆 250.0g\r\n饮用水 1700.0g\r\n橄榄油 50.0g');
INSERT INTO `dishes` VALUES ('96', '红烧鲫鱼', '5', '500', '20', null, null, null, null, '鲫鱼 250克 猪肉(肥瘦) 50克 姜 10克\r\n大蒜 10克\r\n大葱 5克\r\n白砂糖 5克\r\n料酒 5克\r\n豆瓣酱 15克\r\n酱油 10克\r\n味精 2克\r\n醋 10克\r\n花生油 25克');
INSERT INTO `dishes` VALUES ('97', '荞麦馒头', '5', '500', '20', null, null, null, null, '小麦粉(标准粉) 100.0g\r\n苦荞麦粉 100.0g\r\n酵母(干) 5.0g\r\n饮用水 100.0g');
INSERT INTO `dishes` VALUES ('98', '红豆包', '5', '500', '20', null, null, null, null, '小麦粉(标准粉) 40.0g\r\n红豆沙 60.0g\r\n饮用水 26.0g\r\n酵母(干) 0.3g');
INSERT INTO `dishes` VALUES ('99', '紫薯营养粥', '5', '500', '20', null, null, null, null, '紫薯');
INSERT INTO `dishes` VALUES ('100', '挂面', '5', '500', '20', null, null, null, null, '挂面');
INSERT INTO `dishes` VALUES ('101', '面条（煮）', '5', '500', '20', null, null, null, null, '面条（煮）');
INSERT INTO `dishes` VALUES ('102', '马铃薯', '5', '500', '20', null, null, null, null, '马铃薯');
INSERT INTO `dishes` VALUES ('103', '包子（猪肉馅）', '5', '500', '20', null, null, null, null, '面粉 猪肉 白菜');
INSERT INTO `dishes` VALUES ('104', '米饭', '5', '500', '20', null, null, null, null, '米饭');
INSERT INTO `dishes` VALUES ('105', '白薯', '5', '500', '20', null, null, null, null, '白薯');
INSERT INTO `dishes` VALUES ('106', '烙饼', '5', '500', '20', null, null, null, null, '面粉 花生油 盐 葱花');
INSERT INTO `dishes` VALUES ('107', '花卷', '5', '500', '20', null, null, null, null, '花卷');
INSERT INTO `dishes` VALUES ('108', '油条', '5', '500', '20', null, null, null, null, '油条');
INSERT INTO `dishes` VALUES ('109', '包子（三鲜馅）', '5', '500', '20', null, null, null, null, '包子（三鲜馅）');
INSERT INTO `dishes` VALUES ('110', '馒头', '5', '500', '20', null, null, null, null, '面粉');
INSERT INTO `dishes` VALUES ('111', '红烧牛肉方便面', '5', '500', '20', null, null, null, null, '面饼 调味料 蔬菜 肉酱');

-- ----------------------------
-- Table structure for foods
-- ----------------------------
DROP TABLE IF EXISTS `foods`;
CREATE TABLE `foods` (
  `id` int(16) NOT NULL AUTO_INCREMENT COMMENT '编号',
  `name` varchar(255) DEFAULT NULL COMMENT '名称',
  `category` varchar(255) DEFAULT NULL COMMENT '分类',
  `health_index` varchar(11) DEFAULT NULL COMMENT '健康指数',
  `foodsWeight` float DEFAULT '100' COMMENT '重量',
  `calorie` float unsigned DEFAULT '0' COMMENT '热量',
  `carbohydrate` float unsigned DEFAULT '0' COMMENT '碳水化合物',
  `fat` float unsigned DEFAULT '0' COMMENT '脂肪',
  `protein` float unsigned DEFAULT '0' COMMENT '蛋白质',
  `cellulose` float unsigned DEFAULT '0' COMMENT '纤维素',
  `vitamin_A` float unsigned DEFAULT '0' COMMENT '维生素A',
  `magnesium` float unsigned DEFAULT '0' COMMENT '镁',
  `calcium` float unsigned DEFAULT '0' COMMENT '钙',
  `iron` float unsigned DEFAULT '0' COMMENT '铁',
  `potassium` float unsigned DEFAULT '0' COMMENT '钾',
  `sodium` float unsigned DEFAULT '0' COMMENT '钠',
  `estimate` varchar(255) DEFAULT NULL COMMENT '评价',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=235 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of foods
-- ----------------------------
INSERT INTO `foods` VALUES ('1', '鸡蛋', '蛋类、肉类及制品', 'A+', '100', '144', '2.8', '8.8', '13.3', '0', '234', '10', '56', '2', '154', '131.5', '鸡蛋热量及营养与生鸡蛋基本相同，但熟鸡蛋中的营养物质被人体吸收利用效率更高。');
INSERT INTO `foods` VALUES ('2', '排骨', '蛋类、肉类及制品', 'C+', '100', '278', '0.7', '23.1', '16.7', '0', '5', '14', '14', '1.4', '230', '62.6', '脂肪和蛋白质含量都很高的肉类，热量在肉类中属于中等偏高的水平，含有一定量胆固醇，减肥期间不宜多吃。');
INSERT INTO `foods` VALUES ('3', '鸡肉', '蛋类、肉类及制品', 'A+', '100', '124', '0', '4.5', '20.8', '0', '64', '40', '9', '2.1', '276', '74.1', '鸡肉是典型的高蛋白、低脂肪的白肉类，适宜在减肥期间食用，建议进食时去皮。');
INSERT INTO `foods` VALUES ('4', '鸭肉', '蛋类、肉类及制品', 'B', '100', '240', '0.2', '19.7', '15.5', '0', '52', '14', '6', '2.2', '191', '69', '蛋白质和脂肪含量都很高的家禽肉类，在禽肉中属于热量较高的，减肥时不宜多食，但去皮后鸭肉热量不高可以食用。');
INSERT INTO `foods` VALUES ('5', '猪蹄', '蛋类、肉类及制品', 'C+', '100', '260', '0', '18.8', '22.6', '0', '3', '5', '33', '1.1', '54', '101', '高蛋白、高脂肪的肉类，热量较高，胆固醇含量也较高，减肥时不宜多吃。');
INSERT INTO `foods` VALUES ('6', '螃蟹', '蛋类、肉类及制品', 'A+', '100', '103', '2.3', '2.6', '17.5', '0', '389', '23', '126', '2.9', '181', '193.5', '蟹肉含有丰富的蛋白质及钙质等微量元素，而且热量很低，非常适宜减肥期间食用。');
INSERT INTO `foods` VALUES ('7', '猪肉', '蛋类、肉类及制品', 'A+', '100', '143', '1.5', '6.2', '20.3', '0', '44', '25', '6', '3', '305', '57.5', '蛋白质最多、血红素铁最丰富的肉类之一，脂肪较少，热量在肉类中属于低的，与大多数鱼类相当,减肥期间可适量食用。');
INSERT INTO `foods` VALUES ('8', '火腿肠', '蛋类、肉类及制品', 'B', '100', '212', '15.6', '10.4', '14', '0', '5', '22', '9', '4.5', '217', '771.2', '高脂肪，高钠，减肥期间不宜多吃，同时建议选择纯瘦肉食用。');
INSERT INTO `foods` VALUES ('9', '鸡胸脯肉', '蛋类、肉类及制品', 'A+', '100', '133', '2.5', '5', '19.4', '0', '0', '28', '3', '0.6', '338', '34.4', '鸡胸脯肉是鸡身上热量比较低的部位，是减肥期间蛋白质最佳来源之一，非常适宜作为减肥期间的肉类食物来源适量食用。');
INSERT INTO `foods` VALUES ('10', '牛肉', '蛋类、肉类及制品', 'C+', '100', '332', '0', '29.3', '17.1', '0', '0', '0', '0', '0', '0', '0', '虽然蛋白质丰富，但脂肪含量较高，减肥期间不建议食用。');
INSERT INTO `foods` VALUES ('11', '荷包蛋', '蛋类、肉类及制品', 'B+', '100', '199', '1.4', '15', '13.5', '0', '0', '0', '0', '0', '0', '0', '荷包蛋可以很好的保留鸡蛋的营养价值，但因为使用油类进行烹饪，热量增加，在减肥期间要适量食用。');
INSERT INTO `foods` VALUES ('12', '咸鸭蛋', '蛋类、肉类及制品', 'B', '100', '190', '6.3', '12.7', '12.7', '0', '134', '30', '118', '3.6', '184', '2706.1', '咸鸭蛋营养和热量基本与普通鸭蛋相同，但咸鸭蛋中盐分含量很高，不宜大量食用。');
INSERT INTO `foods` VALUES ('13', '草鱼', '蛋类、肉类及制品', 'A+', '100', '113', '0', '5.2', '16.6', '0', '11', '31', '38', '0.8', '312', '46', '和其他鱼类一样，是非常优质的蛋白质来源，适宜作为减肥期间的肉类食物。');
INSERT INTO `foods` VALUES ('14', '鸡腿肉', '蛋类、肉类及制品', 'B+', '100', '181', '0', '13', '16', '0', '44', '34', '6', '1.5', '242', '64.4', '鸡的脂肪多囤积在皮下，鸡腿带皮，所以脂肪含量不低，减肥期间建议去皮后食用。');
INSERT INTO `foods` VALUES ('15', '鲤鱼', '蛋类、肉类及制品', 'A+', '100', '109', '0.5', '4.1', '17.6', '0', '25', '33', '50', '1', '334', '53.7', '高蛋白、低脂肪的常见鱼类，富含钾和磷，减肥时可适量食用。');
INSERT INTO `foods` VALUES ('16', '鹌鹑蛋', '蛋类、肉类及制品', 'B+', '100', '160', '2.1', '11.1', '12.8', '0', '337', '0', '11', '47', '3.2', '106.6', '蛋白质含量较高，但磷和胆固醇含量也很高，减肥时不宜多食。');
INSERT INTO `foods` VALUES ('17', '鲫鱼', '蛋类、肉类及制品', 'A+', '100', '108', '3.8', '2.7', '17.1', '0', '17', '41', '79', '1.3', '290', '41.2', '评价：高蛋白、低脂肪的鱼类，热量在肉类中属于偏低的，钾、磷含量较高，减肥时可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('18', '明虾', '蛋类、肉类及制品', 'A+', '100', '85', '3.8', '1.8', '13.4', '0', '0', '31', '75', '0.6', '238', '119', '评价：蛋白质含量较高、脂肪含量很低的水产肉类，但胆固醇含量较高，减肥时不宜多吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('19', '北京烤鸭', '蛋类、肉类及制品', 'C', '100', '436', '6', '38.4', '16.6', '0', '36', '13', '35', '2.4', '247', '83', '评价：中华名菜，高蛋白、高钾含量，但脂肪含量更高，总体来说热量极高，减肥时不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('20', '牛肉(后腿)', '蛋类、肉类及制品', 'A+', '100', '106', '1.1', '2', '20.9', '0', '3', '21', '5', '3.3', '197', '45.4', '评价：后腿的脂肪量较低，热量较低，减肥期间可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('21', ' 青鱼', '蛋类、肉类及制品', 'A+', '100', '118', '0', '4.2', '20.1', '0', '42', '32', '31', '0.9', '325', '47.4', '评价：常见淡水鱼，是非常优质的蛋白质来源，推荐将其作为减肥期间的主要肉类之一食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('22', ' 猪肉松', '蛋类、肉类及制品', 'C+', '100', '396', '49.7', '11.5', '11.5', '0', '42', '32', '31', '0.9', '325', '47.4', '评价：常见淡水鱼，是非常优质的蛋白质来源，推荐将其作为减肥期间的主要肉类之一食用。\r\n\r\n评价：肉松的营养组成中85%是产能营养素，热量很高，并且其钠含量和胆固醇含量较高，不宜多食。');
INSERT INTO `foods` VALUES ('23', ' 猪血', '蛋类、肉类及制品', 'A+', '100', '55', '0.9', '0.3', '12.2', '0', '0', '0', '5', '4', '8.7', '56', '评价：猪血铁含量较高，并且为较好吸收利用的血红素铁，对于缓解女性由于节食造成的贫血有帮助，减肥时可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('24', '猪肝(卤煮)', '蛋类、肉类及制品', 'B', '100', '203', '5.6', '8.3', '26.4', '0', '4200', '12', '68', '2', '188', '674.7', '评价：高胆固醇，卤制食品尽可能选择瘦猪肉，热量高，减肥期间不宜常吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('25', '脆皮肠', '蛋类、肉类及制品', 'B+', '100', '302', '4.8', '24', '16.6', '0', '0', '0', '0', '0', '0', '0', '评价：脆皮肠中脂肪含量较高，减肥期间不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('26', '鸡肝', '蛋类、肉类及制品', 'A+', '100', '121', '2.8', '4.8', '16.6', '0', '10414', '16', '7', '12', '222', '92', '评价：蛋白质、维生素A和铁含量较高，但同时胆固醇含量也较高，减肥时建议少食。\r\n\r\n');
INSERT INTO `foods` VALUES ('27', '鸭肝', '蛋类、肉类及制品', 'A+', '100', '128', '0.5', '7.5', '14.5', '0', '1040', '18', '18', '23.1', '230', '87.2', '评价：蛋白质与铁含量较高的动物内脏，热量在肉类中属于偏低的，但含一定脂肪和较多胆固醇，可少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('28', '酸奶', '奶类及制品', 'A', '100', '72', '9.3', '2.7', '2.5', '0', '26', '12', '118', '0.4', '150', '39.8', '评价：蛋白质和钙含量较丰富的奶制品，且不含乳糖，适合中国人体质饮用，减肥期间可适量饮用。\r\n\r\n');
INSERT INTO `foods` VALUES ('29', '牛奶', '奶类及制品', 'A', '100', '54', '3.4', '3.2', '3', '0', '24', '11', '104', '0.3', '109', '37.2', '评价：蛋白质和钙含量较丰富的一种饮品，减肥时可选择低脂或脱脂牛奶，每天的建议量为250g。\r\n\r\n');
INSERT INTO `foods` VALUES ('30', '羊奶', '奶类及制品', 'A', '100', '59', '5.4', '3.5', '1.5', '0', '84', '0', '82', '0.5', '135', '20.6', '评价：蛋白质和钙含量较丰富的一种饮品，减肥时可选择低脂或脱脂牛奶，每天的建议量为250g。\r\n\r\n');
INSERT INTO `foods` VALUES ('31', '学生奶', '奶类及制品', 'A', '100', '66', '8.1', '2.6', '0', '0', '0', '0', '0', '0', '0', '0', '评价：针对学生特意强化某些营养素的牛奶，减肥期间可适量饮用。\r\n\r\n');
INSERT INTO `foods` VALUES ('32', '蛋糕(黄蛋糕)', '零食、点心、冷饮', 'C+', '100', '320', '57.1', '6', '9.5', '0.2', '48', '7', '27', '2.2', '80', '32', '评价：蛋糕脂肪含量高，能量大，减肥期间尽量少吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('33', '饼干', '零食、点心、冷饮', 'C', '100', '435', '71.7', '12.7', '9', '1.1', '37', '50', '73', '1.9', '85', '204.1', '评价：脂肪和碳水化合物含量很高，热量很高，减肥期间不适宜多食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('34', '冰淇淋', '零食、点心、冷饮', 'C', '100', '127', '17.3', '5.3', '2.4', '0', '48', '12', '126', '0.5', '125', '54.2', '评价：以饮用水、牛奶、奶粉、奶油（或植物油脂）、食糖等为主要原料制作，能量较高，减肥期间不宜多食。\r\n\r\n');
INSERT INTO `foods` VALUES ('35', '月饼(豆沙)', '零食、点心、冷饮', 'C', '100', '411', '65.6', '13.6', '8.2', '3.1', '7', '43', '64', '3.1', '211', '22.4', '评价：碳水化合物和油脂含量都很大，含糖量高，减肥期间不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('36', '沙琪玛蛋酥', '零食、点心、冷饮', 'D', '100', '506', '58.1', '30.4', '5.9', '0', '0', '0', '0', '0', '0', '0', '评价：一种将面条油炸后加糖成型的小吃，属于添加糖较多，添加油脂较多的食物，热量很高，减肥时不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('37', '板油酥饼', '零食、点心、冷饮', 'C', '100', '360', '49.4', '14.9', '7.6', '0.9', '40', '14', '14', '2.2', '102', '324', '评价：脂肪含量较高的一种烤饼，钠含量也较高，热量较高，减肥时不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('38', '肯德基 薯条', '零食、点心、冷饮', 'A+', '100', '298', '40.5', '15.5', '4.3', '0', '0', '0', '0', '0', '0', '0', '评价：一种油炸零食，热量很高，脂肪含量很高，钠含量较高，减肥时不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('39', '巧克力（黑）', '零食、点心、冷饮', 'C+', '100', '516', '63.1', '30', '4.2', '5.9', '0', '0', '0', '0', '0', '0', '评价：黑巧克力只是糖和奶添加量略少，脂肪含量并没有减少，所以热量依然很高，不宜在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('40', '驴打滚', '零食、点心、冷饮', 'B+', '100', '198', '41.8', '0.2', '8.2', '1.9', '0', '37', '34', '8.6', '165', '192.4', '评价：添加糖的一种小吃，碳水化合物含量很高，热量约是米饭的2倍，减肥时尽量少食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('41', '大白兔红豆奶糖', '零食、点心、冷饮', 'C', '100', '399.75', '83.3', '5.85', '3.5', '0', '0', '0', '0', '0', '0', '0', '评价：一种高碳水化合物的食品，减肥时不宜多食\r\n\r\n');
INSERT INTO `foods` VALUES ('42', '鲜桃果汁糖', '零食、点心、冷饮', 'C', '100', '397', '98.8', '0.2', '0', '0', '32', '11', '14', '1.9', '20', '172.1', '评价：一种糖果，碳水化合物含量高，能量高，不宜在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('43', '棒冰', '零食、点心、冷饮', 'C', '100', '73', '16.1', '1', '0', '0', '0', '0', '0', '0', '0', '0', '评价：以饮用水、牛奶、奶粉、奶油（或植物油脂）、食糖等为主要原料制作，能量较高，减肥期间不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('44', '山楂果丹皮', '零食、点心、冷饮', 'C+', '100', '326', '80', '0.8', '1', '2.6', '25', '66', '52', '11.6', '312', '115.5', '评价：常见蜜饯的一种，高碳水化合物、高钾高钠、高热量，减肥时应尽量少食或不吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('45', '薄荷松仁粽子糖', '零食、点心、冷饮', 'C', '100', '406.31', '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '评价：一种高碳水化合物的食品，减肥时不宜多食\r\n\r\n');
INSERT INTO `foods` VALUES ('46', '红薯干', '零食、点心、冷饮', 'C+', '100', '338', '83.9', '0.1', '2.4', '0', '0', '0', '0', '0', '0', '0', '评价：水分含量低，因此热量比鲜地瓜高不少，与其他蔬果“干”一样，减肥期间不宜多吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('47', '苹果', '蔬果和菌藻', 'A', '100', '53', '13.7', '0.2', '0.4', '1.7', '0', '0', '0', '0', '0', '0', '评价：一种碳水化合物、水分、纤维、钾含量都较高的水果，对于缓解便秘、消除水肿均有一定帮助，适宜减肥时食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('48', '大白菜', '蔬果和菌藻', 'A+', '100', '20', '3.4', '0.2', '1.6', '0.9', '0', '0', '0', '0', '0', '0', '评价：冬季常见的低热量浅色蔬菜，营养含量一般，但热量很低，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('49', '小白菜', '蔬果和菌藻', 'A+', '100', '17', '2.7', '0.3', '1.5', '1.1', '280', '18', '90', '1.9', '178', '73.5', '评价：含水量很高、热量很低的一种蔬菜，含有一定的纤维和植物钙，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('50', '香蕉', '蔬果和菌藻', 'A+', '100', '93', '22', '0.2', '1.4', '1.2', '1.2', '0', '0', '0', '0', '0', '评价：高碳水化合物、高钾含量的一种水果，在水果中热量偏高，减肥时不适合大量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('51', '番茄', '蔬果和菌藻', 'A+', '100', '15', '3.3', '0.2', '0.9', '0', '0', '0', '0', '0', '0', '0', '评价：一种热量低、含水量极高的蔬菜，由于其便携性，也常被当作水果食用，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('52', '黄瓜', '蔬果和菌藻', 'A+', '100', '16', '2.9', '0.2', '0.8', '0.5', '0.5', '0', '0', '0', '0', '0', '评价：一种热量低、含水量极高的蔬菜，由于其便携性，也常被当作水果食用，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('53', '西瓜', '蔬果和菌藻', 'A+', '100', '31', '6.8', '0.3', '0.5', '0.2', '0.2', '0', '0', '0', '0', '0', '评价：含水量很高、热量很低的水果，同时含有一定量的钾，对消除水肿有一定作用，适宜减肥期间食用，但注意控制食用量。\r\n\r\n');
INSERT INTO `foods` VALUES ('54', '桃子', '蔬果和菌藻', 'A+', '100', '42', '10.1', '0.1', '0.6', '1', '1', '0', '0', '0', '0', '0', '评价：热量较低的一种水果，其铁含量在水果中属于较高的，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('55', '上海青', '蔬果和菌藻', 'A+', '100', '18', '3.2', '0.2', '1.7', '1.6', '200', '91', '59', '1.8', '245', '56.9', '评价：含水量很高、热量很低的一种蔬菜，含有一定的纤维和植物钙，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('56', '\r\n 搜索\r\n薄荷食物库 / 蔬果和菌藻 / 红富士苹果', '蔬果和菌藻', 'A', '100', '49', '11.7', '0.4', '0.7', '2.1', '2.1', '0', '0', '0', '0', '0', '评价：一种碳水化合物、水分、纤维、钾含量都较高的水果，对于缓解便秘、消除水肿均有一定帮助，适宜减肥时食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('57', '橙', '蔬果和菌藻', 'A', '100', '48', '11.1', '0.2', '0.8', '0.6', '0.6', '0', '0', '0', '0', '0', '评价：橙的含水量较高，热量在水果中属于中下水平，其维生素C含量并非很高，远低于猕猴桃、无花果等水果，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('58', '菜心', '蔬果和菌藻', 'A+', '100', '28', '4', '0.5', '2.8', '1.7', '1.7', '0', '0', '0', '0', '0', '评价：白菜薹各类营养成分含量比较均衡全面，热量较低，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('59', '柚子', '蔬果和菌藻', 'A+', '100', '42', '9.5', '0.2', '0.8', '0.4', '0.4', '0', '0', '0', '0', '0', '评价：柚子含有一定量维生素C，其热量和钠含量都较低，但它的其他营养在水果中处于偏低水平，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('60', '白萝卜', '蔬果和菌藻', 'A+', '100', '16', '4', '0.1', '0.7', '0', '0', '0', '0', '0', '0', '0', '评价：白萝卜可促进肠道蠕动，预防便秘，同时热量非常低，且饱腹感较强，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('61', '梨', '蔬果和菌藻', 'A', '100', '0', '0', '51', '13.1', '0.1', '0.3', '2.6', '2.6', '0', '0', '0', '评价：钾，水分和纤维含量都较高的一种水果，有利于缓解便秘，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('62', '结球甘蓝(紫）', '蔬果和菌藻', 'A+', '100', '25.4', '6.2', '0.2', '1.2', '3', '0', '0', '0', '0', '0', '0', '评价：紫甘蓝热量及所含营养素种类都与普通甘蓝类似，但含量较高，所以营养价值高于普通甘蓝，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('63', '椰花菜、洋花菜\r\n热', '蔬果和菌藻', 'A+', '100', '20', '4.2', '0.2', '1.7', '2.1', '2.1', '0', '0', '0', '0', '0', '评价：菜花是维生素C和维生素K的优质来源，而且热量较低，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('64', '冬枣', '蔬果和菌藻', 'A+', '100', '113', '27.8', '0.2', '1.8', '2.2', '2.2', '0', '0', '0', '0', '0', '评价：一种高碳水化合物的食品，减肥时不宜多食\r\n\r\n');
INSERT INTO `foods` VALUES ('65', '猕猴桃', '蔬果和菌藻', 'A', '100', '61', '14.5', '0.6', '0.8', '2.6', '2.6', '0', '0', '0', '0', '0', '评价：维生素C含量较丰富的水果，纤维含量也较高，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('66', '南瓜', '蔬果和菌藻', 'A+', '100', '23', '5.3', '0.1', '0.7', '0.8', '0.8', '0', '0', '0', '0', '0', '评价：该食物提供较多的蛋白质、膳食纤维、钙，推荐食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('67', '胡萝卜（老）', '蔬果和菌藻', 'A+', '100', '39', '8.8', '0.2', '1', '1.1', '688', '14', '32', '1', '190', '71.4', '评价：水分和纤维含量较高的蔬菜，由于携带方便，有时也被用来代替水果食用，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('68', '生菜', '蔬果和菌藻', 'A+', '100', '16', '2.1', '0.4', '1.4', '0.6', '60', '29', '70', '1.2', '100', '80', '评价：生菜热量较低，减肥期间适宜食用，且生菜非常适合生食，这样维生素基本没有流失，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('69', '橘子', '蔬果和菌藻', 'A+', '100', '44', '10.2', '0.1', '0.8', '0.5', '0.5', '0', '0', '0', '0', '0', '评价：橘子的含水量较高，热量在水果中属于中下水平，其维生素C含量并非很高，远低于猕猴桃、无花果等水果，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('70', '木瓜', '蔬果和菌藻', 'A+', '100', '30', '7.2', '0', '0.6', '0.5', '0.5', '0', '0', '0', '0', '0', '评价：木瓜是一种热量较低的水果，适宜减肥期间食用，但并无丰胸效果。\r\n\r\n');
INSERT INTO `foods` VALUES ('71', '葡萄', '蔬果和菌藻', 'A', '100', '45', '10.3', '0.3', '0.4', '1', '1', '0', '0', '0', '0', '0', '评价：葡萄中碳水化合物含量约占1/10，并且主要是葡萄糖，可快速被人体吸收利用，减肥时如遇到低血糖可以进食葡萄，减肥期间可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('72', '樱桃番茄（圣女果）', '蔬果和菌藻', 'A+', '100', '25', '5.8', '0.2', '1', '0', '0', '0', '0', '0', '0', '0', '评价：一种热量低、含水量极高的蔬菜，由于其便携性，也常被当作水果食用，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('73', '冬瓜', '蔬果和菌藻', 'A+', '100', '12', '2.6', '0.2', '0.4', '0.7', '13', '8', '19', '0.2', '78', '1.8', '评价：冬瓜微量营养素含量一般，但热量很低，且可消水肿，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('74', '胡萝卜（嫩）', '蔬果和菌藻', 'A+', '100', '32', '8.1', '0.2', '1', '0', '0', '0', '0', '0', '0', '0', '评价：水分和纤维含量较高的蔬菜，由于携带方便，有时也被用来代替水果食用，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('75', ' 卷心菜（包菜，圆白菜）', '蔬果和菌藻', 'A+', '100', '24', '4.6', '0.2', '1.5', '1', '0', '0', '0', '0', '0', '0', '评价：水分含量很高的蔬菜，热量很低，维生素含量与橙子相当，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('76', ' 红枣(鲜)', '蔬果和菌藻', 'B+', '100', '125', '30.5', '0.3', '1.1', '1.9', '1.9', '0', '0', '0', '0', '0', '评价：鲜枣中水分约为2/3，其他主要是碳水化合物，热量和维生素C在水果中偏高，其钾含量也较高，对于缓解水肿有帮助，减肥期间适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('77', '柑桔', '蔬果和菌藻', 'A', '100', '51', '11.9', '0.2', '0.7', '0.4', '148', '11', '35', '0.2', '154', '1.4', '评价：胡萝卜素和钾含量较高的水果，含水量也很高，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('78', '木耳(水发)', '蔬果和菌藻', 'A+', '100', '27', '6', '0.2', '1.5', '2.6', '0', '0', '0', '0', '0', '0', '评价：木耳铁含量极为丰富，补铁补血佳品，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('79', '竹笋', '蔬果和菌藻', 'A+', '100', '23', '3.6', '0.2', '2.6', '1.8', '0', '0', '0', '0', '0', '0', '评价：鲜竹笋的可食用部分水分较多，纤维含量较高，热量很低，其钾含量比较高，可帮助缓解水肿，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('80', '西兰花', '蔬果和菌藻', 'A+', '100', '36', '4.3', '0.6', '4.1', '1.6', '1202', '17', '67', '1', '17', '18.8', '评价：西兰花中维生素A及胡萝卜素含量极为丰富，且热量较低，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('81', '通心菜（空心菜）', '蔬果和菌藻', 'A+', '100', '23', '3.6', '0.3', '2.2', '1.4', '253', '29', '99', '2.3', '243', '94.3', '评价：胡萝卜素及维生素C含量较为丰富，是营养价值较高的深色蔬菜，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('82', '菠菜', '蔬果和菌藻', 'A+', '100', '28', '4.5', '0.3', '2.6', '1.7', '0', '0', '0', '0', '0', '0', '评价：虽然铁含量没有传闻中那么高，但也属于营养丰富的深色蔬菜，热量也较低，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('83', '菠萝', '蔬果和菌藻', 'A+', '100', '44', '44', '0.1', '0.5', '1.3', '0', '0', '0', '0', '0', '0', '评价：含水量高、热量低的一种水果，含有一定钾，可帮助缓解钠摄入过多造成的水肿，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('84', '芒果', '蔬果和菌藻', 'A+', '100', '35', '35', '0.2', '0.6', '1.3', '0', '0', '0', '0', '0', '0', '评价：含水量很高、热量很低的一种水果，但芒果皮中的醛酸等物质可能引起过敏，最好皮去尽后再食用，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('85', '豆芽（绿豆芽）', '蔬果和菌藻', 'A+', '100', '16', '2.6', '0.1', '1.7', '1.2', '0', '0', '0', '0', '0', '0', '评价：水分含量很高、营养价值较低的一种蔬菜，热量很低，含少量纤维，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('86', '茄子', '蔬果和菌藻', 'A+', '100', '23', '4.9', '0.2', '1.1', '1.3', '0', '0', '0', '0', '0', '0', '评价：茄子是为数不多的紫色蔬菜之一，在它的紫皮中含有丰富的维生素E和维生素P，热量低且营养丰富，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('87', '哈密瓜', '蔬果和菌藻', 'A+', '100', '34', '7.9', '0.1', '0.5', '0.2', '0', '0', '0', '0', '0', '0', '评价：一种热量较低、高水分的食品，减肥时适量食用\r\n\r\n');
INSERT INTO `foods` VALUES ('88', '甜瓜', '蔬果和菌藻', 'A+', '100', '26', '6.2', '0.1', '0.4', '0.4', '0', '0', '0', '0', '0', '0', '评价：甜瓜虽甜，糖分含量并不高，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('89', '李子', '蔬果和菌藻', 'A+', '100', '38', '8.7', '0.2', '0.7', '0.9', '0', '0', '0', '0', '0', '0', '评价：李子中果酸较多，能促进消化，热量不高，适宜减肥期间食用，但不能一次大量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('90', '海带（浸）', '蔬果和菌藻', 'A+', '100', '16', '3', '0.1', '1.1', '0.9', '0', '0', '0', '0', '0', '0', '评价：浸润后的海带热量很低，水分和钙的含量较高，同时含较多钾，有利于消除水肿，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('91', '芹菜（药芹）', '蔬果和菌藻', 'A+', '100', '13', '3.1', '0.2', '0.4', '1', '0', '0', '0', '0', '0', '0', '评价：含有大量水分和纤维素，容易有饱腹感，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('92', '通心菜（空心菜）', '蔬果和菌藻', 'A+', '100', '23', '3.6', '0.3', '2.2', '1.4', '253', '29', '99', '2.3', '243', '0', '评价：胡萝卜素及维生素C含量较为丰富，是营养价值较高的深色蔬菜，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('93', '葡萄柚（西柚）', '蔬果和菌藻', 'A+', '100', '33', '7.8', '0.3', '0.7', '0', '0', '0', '0', '0', '0', '0', '评价：柚子中纤维含量较高的品种，水分含量亦很高，热量较低，减肥时作为水果可推荐食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('94', '豌豆苗', '蔬果和菌藻', 'A+', '100', '32', '2.6', '0.8', '4.8', '0', '0', '0', '0', '0', '0', '0', '评价：豌豆苗含钙质、B族维生素、维生素C和胡萝卜素，且含有一定量的蛋白质，营养丰富热量较低，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('95', '小葱', '蔬果和菌藻', 'A+', '100', '27', '4.9', '0.4', '1.6', '1.4', '0', '0', '0', '0', '0', '0', '评价：小葱是一种常见调味蔬菜，热量较低，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('96', '青椒', '蔬果和菌藻', 'A+', '100', '22', '5.2', '0.3', '0.8', '0', '0', '0', '0', '0', '0', '0', '评价：青尖椒中维生素A和C的含量很高，钾含量很高，热量很低，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('97', '洋葱', '蔬果和菌藻', 'A+', '100', '40', '9', '0.2', '1.1', '0.9', '0', '0', '0', '0', '0', '0', '评价：蔬菜中碳水化合物含量较高的一种，但因其较辛辣，MC期间不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('98', '金针菇', '蔬果和菌藻', 'A+', '100', '32', '6', '0.4', '2.4', '2.7', '0', '0', '0', '0', '0', '0', '评价：富含磷和钾，热量低，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('99', '莲藕', '蔬果和菌藻', 'A', '100', '47', '11.5', '0.2', '1.2', '2.2', '0', '0', '0', '0', '0', '0', '评价：藕这类水生蔬菜大多矿物质含量较高，但同时它在蔬菜中属于淀粉含量较高的，减肥期间可以偶尔少量代替主食食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('100', '荔枝', '蔬果和菌藻', 'A', '100', '71', '16.6', '0.2', '0.9', '0.5', '0', '0', '0', '0', '0', '0', '评价：维生素C含量比橙稍高的水果，碳水化合物含量较高，热量在水果中偏高，减肥期间可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('101', '生菜(叶用莴苣)', '蔬果和菌藻', 'A+', '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '\r\n评价：含水量很高、热量很低的蔬菜，胡萝卜素含量极高，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('102', '结球甘蓝（绿）', '蔬果和菌藻', 'A+', '100', '26', '6.3', '0.2', '0.9', '2.3', '0', '0', '0', '0', '0', '0', '评价：紫甘蓝热量及所含营养素种类都与普通甘蓝类似，但含量较高，所以营养价值高于普通甘蓝，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('103', '樱桃', '蔬果和菌藻', 'A', '100', '46', '10.2', '0.2', '1.1', '0.3', '0', '0', '0', '0', '0', '0', '评价：樱桃属于高钾水果，有助于消水肿，热量较低，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('104', '豆芽（黄豆芽）', '蔬果和菌藻', 'A', '100', '47', '4.5', '1.6', '4.5', '1.5', '0', '0', '0', '0', '0', '0', '评价：水分含量很高的一种蔬菜，蛋白质、碳水化合物等含量约是绿豆芽的两倍，含较多纤维，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('105', '苦瓜', '蔬果和菌藻', 'A+', '100', '22', '4.9', '0.1', '1', '1.4', '0', '0', '0', '0', '0', '0', '评价：苦瓜的水分率高，热量很低，维生素C含量比橙子高约1/3，其钾含量较高，有利于消除水肿，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('106', '小叶桔', '蔬果和菌藻', 'A+', '100', '40', '8.8', '0.2', '1.1', '0.9', '0', '0', '0', '0', '0', '0', '\r\n评价：小叶桔一般单重50~60克，果肉富含维生素C、柠檬酸，含水率高且热量较低，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('107', '毛豆', '蔬果和菌藻', 'A+', '100', '131', '10.5', '5', '13.1', '4', '0', '0', '0', '0', '0', '0', '评价：鲜毛豆水分含量接近70%，其蛋白质、碳水化合物等含量在蔬菜中属于较高的，热量也较高，作为蔬菜减肥时可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('108', '豆角', '蔬果和菌藻', 'A+', '100', '34', '6.7', '0.2', '2.5', '2.1', '0', '0', '0', '0', '0', '0', '评价：热量较低、纤维含量较高的蔬菜，有利于缓解便秘，钾含量较高，可缓解水肿，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('109', '丝瓜', '蔬果和菌藻', 'A+', '100', '20', '4', '0.2', '1.3', '0', '0', '0', '0', '0', '0', '0', '评价：水分含量很高的常见蔬菜，含一定量的钾，热量较低，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('110', '紫菜(干)', '蔬果和菌藻', 'B+', '100', '250', '44.1', '1.1', '26.7', '21.6', '0', '0', '0', '0', '0', '0', '评价：干紫菜热量在蔬果类食物中相对较高，纤维含量也很高，同时其钾含量非常高，可帮助缓解便秘、消除水肿，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('111', '四季豆', '蔬果和菌藻', 'A+', '100', '31', '5.7', '0.4', '2', '1.5', '0', '0', '0', '0', '0', '0', '评价：含有一定纤维的蔬菜，水分含量高，热量较低，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('112', '莴笋', '蔬果和菌藻', 'A+', '100', '15', '2.8', '0.1', '1', '0.6', '0', '0', '0', '0', '0', '0', '评价：钾含量和水分含量比较高的一种蔬菜，其他营养方面无突出特点，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('113', '蘑菇(鲜蘑)', '蔬果和菌藻', 'A+', '100', '24', '4.1', '0.1', '2.7', '2.1', '0', '0', '0', '0', '0', '0', '评价：富含磷和钾，热量低，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('114', '银耳(干)', '蔬果和菌藻', 'B+', '100', '261', '67.3', '1.4', '10', '30.4', '0', '0', '0', '0', '0', '0', '评价：碳水化合物含量很高，但其中一半是纤维，有极好的缓解便秘的作用，熟银耳一般配较多汤，水分含量高，热量低，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('115', '杏', '蔬果和菌藻', 'A+', '100', '38', '9.1', '0.1', '0.9', '1.3', '0', '0', '0', '0', '0', '0', '评价：热量较低，钾含量较高的一种水果，可缓解钠摄入过多造成的水肿，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('116', '杨梅', '蔬果和菌藻', 'A+', '100', '30', '6.7', '0.2', '0.8', '1', '0', '0', '0', '0', '0', '0', '评价：水分含量很高，其它营养成分如维生素C、胡萝卜素等含量在水果中都属于低的，适宜减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('117', '韭菜', '蔬果和菌藻', 'A+', '100', '25', '4.5', '0.4', '2.4', '0', '0', '0', '0', '0', '0', '0', '评价：该食物提供较多的蛋白质、钙，推荐食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('118', '西葫芦', '蔬果和菌藻', 'A+', '100', '19', '3.8', '0.2', '0.8', '0.6', '0', '0', '0', '0', '0', '0', '评价：含少量碳水化合物、钾、胡萝卜素等的蔬菜，热量很低，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('119', '油菜心', '蔬果和菌藻', 'A+', '100', '0', '24', '4.9', '0.4', '1.3', '2.2', '0', '0', '0', '0', '0', '评价：纤维含量较高，热量很低的蔬菜，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('120', '平菇', '蔬果和菌藻', 'A+', '100', '17', '3.2', '0.1', '1.7', '0', '0', '0', '0', '0', '0', '0', '评价：钾和纤维含量较高的一种菌菇，对于缓解水肿和便秘有帮助，且水分率高、热量低，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('121', '娃娃菜', '蔬果和菌藻', 'A+', '100', '12.6', '2.4', '0', '1.9', '2.3', '0', '0', '0', '0', '0', '0', '评价：热量极低，水分率很高的一种蔬菜，含有较多纤维，适量食用有利于缓解便秘，推荐减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('122', '甜椒', '蔬果和菌藻', 'A+', '100', '18', '3.8', '0.2', '1', '0', '0', '0', '0', '0', '0', '0', '评价：甜椒富含维生素C，是非常适合生吃的蔬菜，热量较低且营养丰富，推荐在减肥期间食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('123', '豆浆', '坚果、大豆及制品', 'A+', '100', '31', '1.2', '1.6', '3', '0', '0', '0', '0', '0', '0', '0', '评价：含水量90%以上的饮品，热量很低，蛋白质约为牛奶的1/2，钙约为牛奶的1/10，不可替代牛奶，推荐减肥期间作为蛋白质的来源食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('124', '豆腐干（白干）', '坚果、大豆及制品', 'B', '100', '197', '9.6', '11.3', '14.9', '0', '0', '0', '0', '0', '0', '0', '评价：蛋白质含量高，而又不像肉类一样含较多脂肪，减肥期间作为蛋白质的来源可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('125', '黑芝麻', '坚果、大豆及制品', 'C', '100', '559', '24', '46.1', '19.1', '14', '0', '0', '0', '0', '0', '0', '评价：高蛋白、高纤维、高碳水化合物、高脂肪、高热量的一种坚果种子，减肥时可少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('126', '豆腐', '坚果、大豆及制品', 'A', '100', '84', '3.4', '5.3', '6.6', '0', '0', '0', '0', '0', '0', '0', '评价：蛋白质含量较高，豆腐中大豆异黄酮对于女性调理内分泌也有帮助，推荐减肥期间作为蛋白质的来源食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('127', '核桃（干）', '坚果、大豆及制品', 'C', '100', '646', '19.1', '58.8', '14.9', '9.5', '0', '0', '0', '0', '0', '0', '评价：高纤维、高脂肪、高热量，另外碳水化合物和蛋白质含量也较高，减肥时可少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('128', '豆腐花', '坚果、大豆及制品', 'A+', '100', '15', '0', '0.8', '1.9', '0', '0', '28', '18', '0.9', '107', '0', '评价：豆腐脑的含水量较高，蛋白质和热量在豆制品中属于极低的，如加入辣油等调料，热量将有较大升高，推荐减肥期间作为蛋白质的来源食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('129', '栗子(熟)', '坚果、大豆及制品', 'A+', '100', '214', '46.2', '1.5', '4.8', '1.2', '0', '0', '0', '0', '0', '0', '评价：能量较高，碳水化合物含量极丰富，还含有丰富的不饱和脂肪酸、多种维生素和矿物质，减肥期间可少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('130', '花生（鲜）', '坚果、大豆及制品', 'A+', '100', '313', '13', '25.4', '12', '7.7', '0', '0', '0', '0', '0', '0', '评价：鲜花生的纤维含量很高，有一定缓解便秘作用，但同时因其脂肪和热量都较高，减肥时仅可少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('131', '莲子(干)', '坚果、大豆及制品', 'B', '100', '350', '67.2', '2', '17.2', '3', '0', '0', '0', '0', '0', '0', '评价：蛋白质、碳水化合物和钾含量较高，热量很高，通常会加水食用，加水后水分率升高，热量下降，减肥时可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('132', '白芝麻', '坚果、大豆及制品', 'C+', '100', '536', '31.5', '39.6', '18.4', '9.8', '0', '0', '0', '0', '0', '0', '评价：白芝麻与黑芝麻营养成分接近，富含不饱和脂肪酸以及钙、铁等矿物质，但热量很高，减肥时可少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('133', '色拉油', '食用油、油脂及制品', 'C', '100', '898', '0', '99.8', '0', '0', '0', '0', '0', '0', '0', '0', '评价：最常见的烹调用油之一，脂肪含量接近100%，含少量维生素E，除油炸等极高温度下，不易破坏，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('134', '花生油', '食用油、油脂及制品', 'C', '100', '899', '0', '99.9', '0', '0', '0', '0', '0', '0', '0', '0', '评价：烹调菜肴常用的油脂，脂肪含量达到99.9%，其中80%以上为不饱和脂肪酸，属于比较健康的油脂，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('135', '豆油', '食用油、油脂及制品', 'C', '100', '899', '0', '99.9', '0', '0', '0', '0', '0', '0', '0', '0', '评价：最常见的烹调用油之一，脂肪含量接近100%，含少量维生素E，除油炸等极高温度下，不易破坏，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('136', '混合油(菜+棕)', '食用油、油脂及制品', 'C', '100', '900', '0.1', '99.9', '0', '0', '0', '0', '0', '0', '0', '0', '评价：由两种油脂制作的混合油，一定程度上提高了营养价值，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('137', '葵花籽油', '食用油、油脂及制品', 'C', '100', '899', '0', '99.9', '0', '0', '0', '0', '0', '0', '0', '0', '评价：葵花籽油是一种常见食用植物油，富含亚油酸，与其他植物油一样，有显著降低胆固醇，防止血管硬化和预防冠心病的作用，但热量较高，减肥期间要适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('138', '橄榄油', '食用油、油脂及制品', 'C', '100', '899', '0', '99.9', '0', '0', '0', '0', '0', '0', '0', '0', '评价：该食物含有较多的脂肪，不建议食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('139', '菜籽油', '食用油、油脂及制品', 'C', '100', '899', '0', '99.9', '0', '0', '0', '0', '0', '0', '0', '0', '评价：菜籽油是一种常见植物油，富含维生素E以及亚麻酸、亚油酸等人体所必需不饱和脂肪酸，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('140', '辣椒油', '食用油、油脂及制品', 'C', '100', '900', '0', '100', '0', '0', '0', '0', '0', '0', '0', '0', '评价：辣椒油更多的作为调料，而非食用油，热量很高，减肥期间要注意控制油脂总量，减肥期间不宜多吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('141', '芝麻油', '食用油、油脂及制品', 'C', '100', '898', '0.2', '99.7', '0', '0', '0', '0', '0', '0', '0', '0', '评价：即香油，是一种常见油类调料，虽然80%以上为不饱和脂肪酸，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('142', '金龙鱼食用调和油', '食用油、油脂及制品', 'C', '100', '884.32', '0', '100', '0', '0', '0', '0', '0', '0', '0', '0', '评价：减肥是需要摄入适量植物油，以补充人体所必须的不饱和脂肪酸，但油脂热量很高，不宜多吃\r\n\r\n');
INSERT INTO `foods` VALUES ('143', '猪油(板油)', '食用油、油脂及制品', 'C', '100', '827', '7.2', '88.7', '0', '0', '89', '1', '0', '2.1', '14', '0', '评价：猪油中含有大量饱和脂肪酸，食用过量会造成心脑血管疾病的隐患，减肥期间不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('144', '玉米油', '食用油、油脂及制品', 'C', '100', '895', '0.5', '99.2', '0', '0', '0', '0', '0', '0', '0', '0', '评价：玉米油是一种常见食用植物油，富含亚油酸，与其他植物油一样，有显著降低胆固醇，防止血管硬化和预防冠心病的作用，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('145', '香油', '食用油、油脂及制品', 'C', '100', '898', '0.2', '99.7', '0', '0', '0', '0', '0', '0', '0', '0', '评价：减肥是需要摄入适量植物油，以补充人体所必须的不饱和脂肪酸，但油脂热量很高，不宜多吃\r\n\r\n');
INSERT INTO `foods` VALUES ('146', '黄油', '食用油、油脂及制品', 'E', '100', '888', '0', '98', '1.4', '0', '0', '7', '35', '0.8', '39', '0', '评价：黄油的主要成分是脂肪，其含量在90%左右，剩下的主要是水分，所以热量非常高，且所含的脂肪酸为饱和脂肪酸，对健康不利，减肥期间不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('147', '金龙鱼 玉米油', '食用油、油脂及制品', 'C', '100', '884.32', '0', '100', '0', '0.7', '0', '0', '0', '0', '0', '0', '评价：减肥是需要摄入适量植物油，以补充人体所必须的不饱和脂肪酸，但油脂热量很高，不宜多吃\r\n\r\n');
INSERT INTO `foods` VALUES ('148', '茶油', '食用油、油脂及制品', 'C', '100', '899', '0', '99.9', '0', '0', '0', '0', '0', '0', '0', '0', '评价：含油酸、亚油酸等不饱和脂肪酸，其脂肪酸含量、比例与橄榄油极为相似，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('149', '胡麻油', '食用油、油脂及制品', 'C', '100', '900', '0', '100', '0', '0', '0', '0', '0', '0', '0', '0', '评价：含亚麻酸、亚油酸、油酸及棕榈酸、硬脂酸等甘油酸，有一定药用价值，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('150', '大麻油', '食用油、油脂及制品', 'C', '100', '899', '0', '99.9', '0', '0', '0', '0', '0', '0', '0', '0', '评价：富含亚油酸和亚麻酸等人体必需的不饱和脂肪酸，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('151', '牛油(炼)', '食用油、油脂及制品', 'C', '100', '898', '0.1', '99.7', '0', '0', '89', '0', '0', '0', '0', '0', '评价：牛油中含有大量饱和脂肪酸，食用过量会引起心脑血管疾病的隐患，减肥期间不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('152', '棕榈油', '食用油、油脂及制品', 'C', '100', '900', '0', '100', '0', '0', '0', '0', '0', '0', '0', '0', '评价：含有50%的饱和脂肪，富含中性脂肪酸，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('153', '核桃油', '食用油、油脂及制品', 'C', '100', '898', '0', '99.8', '0', '0', '0', '0', '0', '0', '0', '0', '评价：不含胆固醇和黄菌霉素，不饱和脂肪含量高达85.2－95.8%，富含钙、铁、锌等微量元素，但热量较高，减肥期间要适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('154', '椰子油', '食用油、油脂及制品', 'C', '100', '898', '0', '99.9', '0', '0', '0', '0', '0', '0', '0', '0', '评价：唯一由中链脂肪酸组成的油脂，注意温度，如果过热，会产生有害物质，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('155', '米糠油', '食用油、油脂及制品', 'C', '100', '894', '1.3', '98.7', '0', '0', '0', '0', '0', '0', '0', '0', '评价：脂肪酸组成较为均衡，且含有丰富的Ve、复合脂质、磷脂等几十种天然生物活性成分，不饱和脂肪酸含量高达80%以上，但热量较高，减肥期间要适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('156', '红花油', '食用油、油脂及制品', 'C', '100', '899', '0', '99.9', '0', '0', '0', '0', '0', '0', '0', '0', '评价：含亚麻酸、亚油酸、油酸及棕榈酸、硬脂酸等甘油酸，有一定药用价值，但热量较高，减肥期间要适量。\r\n\r\n');
INSERT INTO `foods` VALUES ('157', '五丰 花椒油', '食用油、油脂及制品', 'C', '100', '804.73', '0', '91', '0', '0', '0', '0', '0', '0', '0', '0', '评价：减肥是需要摄入适量植物油，以补充人体所必须的不饱和脂肪酸，但油脂热量很高，不宜多吃\r\n\r\n');
INSERT INTO `foods` VALUES ('186', '蜂蜜', '调味品', 'B+', '100', '321', '75.6', '1.9', '0.4', '0', '0', '2', '4', '1', '28', '0', '评价：蜂蜜中果糖和葡萄糖各占一半，热量较高，但其是应对低血糖的很好食品，另外蜂蜜含有乙酰胆碱，可缓解便秘，减肥期间可少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('187', '白砂糖', '调味品', 'C', '100', '400', '99.9', '0', '0', '0', '0', '3', '20', '0.6', '5', '0.4', '评价：一种日常调味品，碳水化合物含量接近100%，高热量，几乎无其他营养，减肥时应控制食用量。\r\n\r\n');
INSERT INTO `foods` VALUES ('188', '榨菜', '调味品', 'A+', '100', '33', '6.5', '0.3', '2.2', '2.1', '82', '54', '155', '3.9', '363', '363', '评价：一种腌制食品，常被用来佐餐粥类，含一定量纤维，热量也较低，但钠含量极高，减肥期间不宜多食。\r\n\r\n');
INSERT INTO `foods` VALUES ('189', '红糖', '调味品', 'C', '100', '389', '96.6', '0', '0.7', '0', '0', '54', '157', '2.2', '240', '240', '评价：红糖是未经高度精炼的蔗糖，营养价值高于白糖，但热量较高，减肥期间不宜多吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('190', '醋', '调味品', 'A+', '100', '31', '4.9', '0.3', '2.1', '0', '0', '13', '17', '6', '351', '351', '评价：一种常见调味料，多由粮食发酵而来，含有少量蛋白质和碳水化合物，钾和钠含量比较高，减肥期间可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('191', '酱油', '调味品', 'A', '100', '63', '10.1', '0.1', '5.6', '0.2', '0', '156', '66', '8.6', '337', '337', '评价：钠含量极高的一种调料，除能调节菜肴颜色外，对菜的咸淡程度也有很大影响，减肥期间注意勿过量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('192', '芝麻酱', '调味品', 'C', '100', '630', '22.7', '52.7', '19.2', '5.9', '17', '238', '1170', '50.3', '342', '342', '评价：富含蛋白质的一种调味品，常用来吃火锅或拌蔬菜沙拉，但因为脂肪含量和热量都极高，减肥时尽量少吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('193', '腐乳(白)', '调味品', 'B+', '100', '135', '4.8', '8.2', '10.9', '0.9', '22', '75', '61', '3.8', '84', '84', '评价： 腐乳富含植物蛋白质，经过发酵后，蛋白质分解为各种氨基酸，而且维生素B族的含量很丰富，减肥期间可适当食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('194', '花生酱', '调味品', 'D', '100', '600', '25.3', '53', '6.9', '3', '0', '21', '67', '7.2', '99', '99', '评价：高脂肪、高钠、高碳水化合物含量的一种调味酱料，热量极高，减肥时不宜食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('195', '红豆沙', '调味品', 'B', '100', '244', '57.1', '0.1', '4.5', '1.8', '0', '0', '0', '0', '0', '0', '评价：市售红豆馅往往添加不少白糖与油脂，因此热量较高，减肥期间需适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('196', '辣椒酱', '调味品', 'A+', '100', '36', '3.2', '2.8', '0.8', '2.6', '132', '91', '117', '3.8', '222', '222', '评价：碳水化合物、蛋白质、脂肪都含量较少，能量较低，减肥期间可少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('197', '味精', '调味品', 'B+', '100', '268', '26.5', '0.2', '40.1', '0', '0', '7', '100', '1.2', '4', '4', '评价：作为调味品，有一定的营养价值，但能量较高，减肥期间应少量使用。\r\n\r\n');
INSERT INTO `foods` VALUES ('198', '冰糖', '调味品', 'C', '100', '397', '99.3', '0', '0', '0', '0', '2', '23', '1.4', '1', '2.7', '评价：冰糖是砂糖结晶再制品，碳水化和物含量接近100%，且为单糖，人体很容易吸收利用，主要提供能量，减肥期间不宜多吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('199', '鸡精', '调味品', 'B', '100', '195', '33.2', '2.8', '10.7', '0.7', '0', '0', '0', '0', '0', '0', '评价：鸡精是以新鲜鸡肉、鸡骨、鸡蛋为原料制成的复合增鲜、增香的调味料，可以增进食欲，因此减肥期间不宜多吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('200', '番茄酱', '调味品', 'A', '100', '83', '16.9', '0.2', '4.9', '2.1', '0', '37', '28', '1.1', '989', '37.1', '评价：糖分相对较少，能量稍低，减肥期间可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('201', '绵白糖', '调味品', 'C', '100', '396', '98.9', '0', '0.1', '0', '0', '2', '6', '0.2', '2', '2', '评价：绵白糖是结晶颗粒细小的白糖，升糖指数很高，减肥期间不宜多吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('202', '食盐', '调味品', 'A+', '100', '0', '0', '0', '0', '0', '0', '2', '22', '1', '14', '14', '评价：作为调味品，有一定的营养价值，减肥期间应少量使用。\r\n\r\n');
INSERT INTO `foods` VALUES ('203', '沙拉酱（色拉酱）', '调味品', 'E', '100', '724', '1', '78.8', '2.8', '0', '0', '0', '0', '0', '0', '0', '评价：热量极高的调味酱，大部分是脂肪，另有不少水分，减肥时应尽量少食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('204', '豆瓣酱', '调味品', 'B+', '100', '181', '17.1', '6.8', '13.6', '1.5', '0', '125', '53', '16.4', '772', '0', '评价：豆瓣酱是蚕豆、食盐、辣椒等原料酿制而成的酱，未额外添加油脂的豆瓣酱热量较高，减肥期间可少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('205', '豆沙', '调味品', 'B', '100', '247', '52.7', '1.9', '5.5', '1.7', '0', '2', '42', '8', '139', '23.5', '评价：高碳水化合物的一种馅料，常被用来包包子、粽子、月饼等，糖分含量较高，减肥时不宜多食。\r\n\r\n');
INSERT INTO `foods` VALUES ('206', '甜面酱', '调味品', 'B+', '100', '139', '28.8', '0.6', '5.5', '1.4', '5', '26', '29', '3.6', '189', '2097.2', '评价：甜面酱是以面粉为主要原料加工制成，热量不高，但盐分含量不低，减肥期间可以少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('207', '酱黄瓜', '调味品', 'A+', '100', '26', '3.4', '0.3', '3', '1.2', '30', '17', '52', '3.7', '299', '3769.5', '评价：一种腌制食品，常被用来佐餐粥类，含一定量纤维，热量也较低，但钠含量极高，减肥期间不宜多食。\r\n\r\n');
INSERT INTO `foods` VALUES ('208', '千岛沙拉酱', '调味品', 'D+', '100', '475', '20.9', '43.4', '2.3', '1.1', '0', '0', '0', '0', '0', '0', '评价：高脂肪的调味酱料，热量极高，减肥时不宜多吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('209', '雪菜', '调味品', 'A+', '100', '38.6', '8.7', '1.6', '1.5', '8.3', '0', '0', '0', '0', '0', '0', '评价：一种腌制食品，常被用来佐餐粥类，含一定量纤维，热量也较低，但钠含量极高，减肥期间不宜多食。\r\n\r\n');
INSERT INTO `foods` VALUES ('210', '番茄沙司', '调味品', 'A+', '100', '112', '28', '0.2', '1', '1.4', '0', '0', '0', '0', '0', '0', '评价：番茄沙司是番茄酱加糖、醋、食盐在色拉油里炒熟调制出的一种酸甜汁水，番茄中的维生素在加工过程中流失较大，但番茄红素的利用度反而更高，减肥期间可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('211', '白醋', '调味品', 'A+', '100', '6', '0', '0.6', '0.1', '0', '0', '5', '26', '2.2', '12', '225.9', '评价：醋的热量很低，但可以开胃，促进唾液和胃液的分泌，一方面帮助消化吸收，一方面使食欲旺盛，减肥期间要注意控制。\r\n\r\n');
INSERT INTO `foods` VALUES ('212', '辣椒粉', '调味品', 'B+', '100', '290', '57.7', '9.5', '15.2', '43.5', '3123', '223', '146', '20.7', '1358', '100', '评价：作为调味品，有一定的营养价值，但能量较高，减肥期间应少量使用。\r\n\r\n');
INSERT INTO `foods` VALUES ('213', '胡椒粉', '调味品', 'C', '100', '361', '76.9', '2.2', '9.6', '2.3', '10', '128', '2', '9.1', '154', '4.9', '评价：作为调味品，有一定的营养价值，但能量较高，减肥期间应少量使用。\r\n\r\n');
INSERT INTO `foods` VALUES ('214', '五香豆豉', '调味品', 'B+', '100', '270', '39.7', '3', '24.1', '5.9', '0', '202', '29', '3.7', '715', '263.8', '评价：豆豉为传统发酵豆制品，含有一定量的蛋白质以及镁、钙等矿物质，但热量较高，减肥期间要少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('215', '陈醋', '调味品', 'A', '100', '114', '17.9', '0.3', '9.8', '0', '0', '132', '125', '13.9', '715', '836', '评价：陈醋中含有一定量的碳水化合物及蛋白质，但有开胃、促进食欲的作用，减肥期间不宜多吃。\r\n\r\n');
INSERT INTO `foods` VALUES ('216', '红豆馅', '调味品', 'C+', '100', '261', '61.7', '0.2', '4.5', '2.8', '0', '0', '0', '0', '0', '0', '评价：市售红豆馅往往添加不少白糖与油脂，因此热量较高，减肥期间需适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('217', '麻辣酱', '调味品', 'A+', '100', '145', '21.4', '5.1', '5.8', '5', '37', '37', '186', '13', '366', '3222.5', '评价：碳水化合物含量较高，能量较高，减肥期间可少量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('218', '咖喱粉', '调味品', 'B+', '100', '341.2', '63.3', '12.2', '13', '36.9', '0', '0', '0', '0', '0', '0', '评价：咖喱是一种复合调料，其中膳食纤维含量较高，总热量不高，减肥期间可以适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('219', '老抽', '调味品', 'B+', '100', '129', '23.8', '0.3', '7.9', '0', '0', '0', '0', '0', '0', '0', '评价：老抽酱油是在生抽酱油的基础上再深加工而成，碳水化合物和蛋白质含量都更高，钠含量也极高，减肥期间应控制食用量。\r\n\r\n');
INSERT INTO `foods` VALUES ('220', '花椒', '调味品', 'B+', '100', '316', '66.5', '8.9', '6.7', '28.7', '0', '0', '0', '0', '0', '0', '评价：作为调味品，有一定的营养价值，但能量较高，减肥期间应少量使用。\r\n\r\n');
INSERT INTO `foods` VALUES ('221', '五香醋', '调味品', 'A+', '100', '14', '3', '0', '0.5', '0', '0', '0', '105', '5.2', '116', '185', '评价：一种常见调味料，多由粮食发酵而来，含有少量蛋白质和碳水化合物，钾和钠含量比较高，减肥期间可适量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('222', '黄豆酱油', '调味品', 'A+', '100', '38', '4.3', '0.2', '5.1', '0', '0', '0', '0', '0', '0', '0', '评价：钠含量极高的一种调料，除能调节菜肴颜色外，对菜的咸淡程度也有很大影响，减肥期间注意不要过量食用。\r\n\r\n');
INSERT INTO `foods` VALUES ('223', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', null);
INSERT INTO `foods` VALUES ('224', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', null);
INSERT INTO `foods` VALUES ('225', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', null);
INSERT INTO `foods` VALUES ('226', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', null);
INSERT INTO `foods` VALUES ('227', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', null);
INSERT INTO `foods` VALUES ('228', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', null);
INSERT INTO `foods` VALUES ('229', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '');
INSERT INTO `foods` VALUES ('230', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', null);
INSERT INTO `foods` VALUES ('231', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', null);
INSERT INTO `foods` VALUES ('232', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', null);
INSERT INTO `foods` VALUES ('233', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', null);
INSERT INTO `foods` VALUES ('234', null, '调味品', null, '100', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', '0', null);

-- ----------------------------
-- Table structure for orderhistory
-- ----------------------------
DROP TABLE IF EXISTS `orderhistory`;
CREATE TABLE `orderhistory` (
  `id` int(11) NOT NULL,
  `studentId` varchar(255) DEFAULT NULL,
  `dishesId` varchar(255) DEFAULT NULL,
  `reserveTime` varchar(255) DEFAULT NULL,
  `pickTime` varchar(255) DEFAULT NULL,
  `orderState` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of orderhistory
-- ----------------------------
INSERT INTO `orderhistory` VALUES ('1', '', null, null, null, null);
INSERT INTO `orderhistory` VALUES ('2', null, null, null, null, null);
INSERT INTO `orderhistory` VALUES ('3', null, null, null, null, null);
INSERT INTO `orderhistory` VALUES ('4', null, null, null, null, null);

-- ----------------------------
-- Table structure for student
-- ----------------------------
DROP TABLE IF EXISTS `student`;
CREATE TABLE `student` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `stuId` varchar(16) DEFAULT NULL,
  `stuName` varchar(255) DEFAULT NULL,
  `gender` varchar(255) DEFAULT NULL,
  `balance` float(255,0) DEFAULT '100',
  `tel` varchar(255) DEFAULT NULL,
  `major` varchar(255) DEFAULT '软件工程',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=41 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of student
-- ----------------------------
INSERT INTO `student` VALUES ('1', '15110572121', '张天', '男', '100', '17864308260', '软件工程');
INSERT INTO `student` VALUES ('2', '15110572122', '张甲林', '男', '100', '17864308001', '软件工程');
INSERT INTO `student` VALUES ('3', '15110572123', '陈俊杰', '男', '100', '17864308002', '软件工程');
INSERT INTO `student` VALUES ('4', '15110572124', '沈圣', '男', '100', '17864308003', '软件工程');
INSERT INTO `student` VALUES ('5', '15110572125', '李昊阳', '男', '100', '17864308004', '软件工程');
INSERT INTO `student` VALUES ('6', '15110572126', '马冲', '男', '100', '17864308005', '软件工程');
INSERT INTO `student` VALUES ('7', '15110572127', '魏亚桐', '男', '100', '17864308006', '软件工程');
INSERT INTO `student` VALUES ('8', '15110572128', '尹瑀琛', '男', '100', '17864308007', '软件工程');
INSERT INTO `student` VALUES ('9', '15110572129', '邵昊', '男', '100', '17864308008', '软件工程');
INSERT INTO `student` VALUES ('10', '15110572130', '秦廷浩', '男', '100', '17864308009', '软件工程');
INSERT INTO `student` VALUES ('11', '15110572131', '王根云', '男', '100', '17864308010', '软件工程');
INSERT INTO `student` VALUES ('12', '15110572132', '陈振', '男', '100', '17864308011', '软件工程');
INSERT INTO `student` VALUES ('13', '15110572133', '刘兆宏', '男', '100', '17864308012', '软件工程');
INSERT INTO `student` VALUES ('14', '15110572134', '周化峰', '男', '100', '17864308013', '软件工程');
INSERT INTO `student` VALUES ('15', '15110572135', '董书磊', '男', '100', '17864308014', '软件工程');
INSERT INTO `student` VALUES ('16', '15110572136', '朱晓栋', '男', '100', '17864308015', '软件工程');
INSERT INTO `student` VALUES ('17', '15110572137', '李汶冰', '男', '100', '17864308016', '软件工程');
INSERT INTO `student` VALUES ('18', '15110572138', '邢福军', '男', '100', '17864308017', '软件工程');
INSERT INTO `student` VALUES ('19', '15110572139', '王朋', '男', '100', '17864308018', '软件工程');
INSERT INTO `student` VALUES ('20', '15110572140', '王辉', '男', '100', '17864308019', '软件工程');
INSERT INTO `student` VALUES ('21', '15110572141', '丁一飞', '男', '100', '17864308020', '软件工程');
INSERT INTO `student` VALUES ('22', '15110572142', '孔凡奇', '男', '100', '17864308021', '软件工程');
INSERT INTO `student` VALUES ('23', '15110572143', '何家乐', '男', '100', '17864308022', '软件工程');
INSERT INTO `student` VALUES ('24', '15110572144', '张文涛', '男', '100', '17864308023', '软件工程');
INSERT INTO `student` VALUES ('25', '15110572145', '张文韬', '男', '100', '17864308024', '软件工程');
INSERT INTO `student` VALUES ('26', '15110572146', '薛贤贤', '男', '100', '17864308025', '软件工程');
INSERT INTO `student` VALUES ('27', '15110572147', '王德强', '男', '100', '17864308096', '软件工程');
INSERT INTO `student` VALUES ('28', '15110572148', '黄平', '男', '100', '17864308017', '软件工程');
INSERT INTO `student` VALUES ('29', '15110572149', '丁友鑫', '男', '100', '17864308018', '软件工程');
INSERT INTO `student` VALUES ('30', '15110572150', '徐建臻', '男', '100', '17864308019', '软件工程');
INSERT INTO `student` VALUES ('31', '15110572151', '汪之路', '男', '100', '17864308020', '软件工程');
INSERT INTO `student` VALUES ('32', '15110572152', '杨巧娜', '女', '100', '17864308021', '软件工程');
INSERT INTO `student` VALUES ('33', '15110572153', '王雪燕', '女', '100', '17864308022', '软件工程');
INSERT INTO `student` VALUES ('34', '15110572154', '张洁', '女', '100', null, '软件工程');
INSERT INTO `student` VALUES ('35', '15110572155', '张东霞', '女', '100', null, '软件工程');
INSERT INTO `student` VALUES ('36', '15110572156', '徐上上', '女', '100', null, '软件工程');
INSERT INTO `student` VALUES ('37', '15110572157', '牛静', '女', '100', null, '软件工程');
INSERT INTO `student` VALUES ('38', '15110572158', '杜昱瑾', '女', '100', null, '软件工程');
INSERT INTO `student` VALUES ('39', '15110572159', '胡雪妍', '女', '100', null, '软件工程');
INSERT INTO `student` VALUES ('40', '15110572160', '潘叙珍', '女', '100', null, '软件工程');
